#include <bits/stdc++.h>
using namespace std;
int n, a[5010], sum[5010], ans;
int f[25000010] = {1}, mod = 998244353;
//前 i 个数中和等于 j 的方案数 
int main(){
	freopen("polygon.in", "r", stdin);
	freopen("polygon.out", "w", stdout);
	cin >> n;
	for (int i = 1; i <= n; i ++)cin >> a[i];
	sort(a + 1, a + n + 1);
	for (int i = 1; i <= n; i ++){//前 i 根木棍
		if (i >= 3){
			for (int j = a[i] + 1; j <= sum[i - 1]; j ++)(ans += f[j]) %= mod;
		}
		sum[i] = sum[i - 1] + a[i];
		for (int j = sum[i - 1]; j >= 0; j --)
			(f[j + a[i]] += f[j]) %= mod;//选 or 不选
	}
	cout << ans;
	return 0;
}
//首先是求 n 个数中任选数之和大于 k 的方案
//f[i][j] 前 i 个选出等于 j 的方案数
//f[i][j] = f[i - 1][j - a[i]] + f[i - 1][j]        (f[i][0] = 1)
/*
    壬戌之秋，七月既望，苏子与客泛舟游于赤壁之下。清风徐来，水波不兴，举酒属客，颂明月之诗，歌窈窕之章。少焉，月出于东山之上，徘徊于斗牛之间。白露横江，水光接天，纵一苇之有如，凌万顷之茫然。浩浩乎如冯虚御风，而不知其所止；飘飘乎如遗世独立，羽化而登仙。
    于是饮酒乐甚，扣舷而歌之。歌曰：桂棹兮兰桨，击空明兮溯流光；渺渺兮予怀，望美人兮天一方。客有吹洞箫者，倚歌而和之。其声呜呜然，如怨如慕，如泣如诉。舞幽壑之潜蛟，泣孤舟之嫠妇。
    苏子愀然，正襟危坐而问客曰：何为其然也？客曰：月明星稀，乌鹊南飞，此非曹孟德之诗乎？西望夏口，东望武昌，此非孟德之困于周郎者乎？方其荆州，下江陵，顺流而下者，舳舻千里，旌旗蔽空，酾酒临江，横槊赋诗，固一世之雄也，而今安在哉？况吾与子渔樵于江渚之上，侣鱼虾而友麋鹿，驾一叶之扁舟，举匏樽以相属，寄浮游于天地，渺沧海之一粟，哀吾生之须臾，羡长江之无穷，挟飞仙以遨游，抱明月而长终，之不可乎骤得，托遗响于悲风。
    苏子曰：客亦知夫水与月乎？逝者如斯，而未尝往也；盈虚者如彼，而足莫消长也。盖将自其变者而观之，则天地不能以一瞬；自其不变者而观之，则物与我皆无尽也。且夫天地之间，物各有主，苟非吾之所有，虽一毫而莫取。惟江上之清风，与山间之明月，耳得之而为声，目遇之而成色，是造物者之无尽藏也，而吾与子之所共适。
    客喜而笑，洗盏更酌，肴核既尽，杯盘狼藉，相与枕藉乎舟中，不知东方之既白。
*/
