#include <bits/stdc++.h>

using namespace std;

int n, m, c[510];
string s;

int main()
{
	freopen("employ.in", "r", stdin);
	freopen("employ.out", "w", stdout);
	scanf("%d %d", &n, &m);
	cin >> s;
	for (int i = 0; i < n; i ++ )
		scanf("%d", &c[i]);
	cout << 0 << '\n';
	return 0;
}
/*
林中鸟
葛林
来不及祈祷
就开始奔跑
总觉得外面世界有多美好
用几滴眼泪
才换来骄傲
我要的光荣哪怕只有一秒
角落太寂静
城市太喧闹
这世界很忙其实我都知道
离开了地面
就随风飘摇
决定要走遍天涯心比天高
我就像那一只
林中的小鸟
努力挣脱冲向蓝天怀抱
勇敢地张开双臂
闭上了双眼
远方离我只有一步之遥
我就像那一只
林中的小鸟
举头望月孤独有谁知道
那带血的羽毛
不向命运祈祷
远方离我只有一步之遥
来不及祈祷
就开始奔跑
总觉得外面世界有多美好
用几滴眼泪
才换来骄傲
我要的光荣哪怕只有一秒
角落太寂静
城市太喧闹
这世界很忙其实我都知道
离开了地面
就随风飘摇
决定要走遍天涯心比天高
我就像那一只
林中的小鸟
努力挣脱冲向蓝天怀抱
勇敢地张开双臂
闭上了双眼
远方离我只有一步之遥
我就像那一只
林中的小鸟
举头望月孤独有谁知道
那带血的羽毛
不向命运祈祷
远方离我只有一步之遥
我就像那一只
林中的小鸟
举头望月孤独有谁知道
那带血的羽毛
不向命运祈祷
远方离我只有一步之遥
远方离我只有一步之遥

那一只林中鸟
那一只林中鸟
*/
