#include<bits/stdc++.h>
#define int long long
#define endl '\n' //唐 
using namespace std;

int main()
{
	freopen("polygon.in","r",stdin);
	freopen("polygon.out","w",stdout);
	int n;
	cin>>n;
	cout<<"i can't do it"<<endl; 
	fclose(stdin);
	fclose(stdout);
	return 0;
}







/*我是考号为HE-J00880的考生杜沛怿，现在我正在坐在CSP-J第二轮的考场上，我没事干，于是写下来打发时间
现在是11:05am，一会这个文件（新建文件夹）就要被删除，也没啥好说的了
还记得2022年，我当时喜欢玩mcJAVA版，玩别人的模组玩腻了，想要自己做一个mod
但是我找不到mod教程，但就在一次我刷b的时候看到了一个制作数据包的视频，我心血来潮
把VSC下载上了，然后开始配置环境，照着教程一步一步来
当我做完全部成就时，我感觉到了一种强烈的满足感
至此，我的代码生涯开始了
我妈找到中心的老师，看看他们教不教，于是我接触到了我这辈子第一次见到的编程语言：Python
第一课学会配置环境和print，这些都很简单，我在我家电脑上面下载了一个IDLE，然后在VSC上配置了一个python环境
至此，我打出了我这一辈子的第一行代码

print("Hello World")

至此，我算是正式踏上了信息学这条路
我的学习能力还算好，不是很强，但是我也很用心的学了
数组、字符、整型、浮点
这些我都熟记于心；
循环、顺序、分支、递归
这些我都至今难忘
在我学到if判断时，我做了一个简易的计算器
为了实现某些功能，我日思夜想，不会的上网搜
源代码我现在还留着，随着math库的引入，我的计算器也越来越丰富了
不过这个计算器到后来也就不做了，原因我本人也忘掉了
后来我的python学到一半了吧，我开始转战c++
c++没有了python的简洁，但取而代之的是更高的效率
我需要背记的东西很多，但是我从没后悔
第一节课教了教头文件 命名空间还有cout
依旧是一成不变的

cout<<"Hello World";

但是print被代替，括号变成输出流符号，句末还加上了分号
我很不习惯，可是勤加练习，我便也学会了
再到后来，老师提到了NOI和NOIP，我感觉那些太远大了，我纵使再厉害，也不可能到达吧
2024年，我们又转战无人机与模拟飞行，我的父母不是很赞成，但也允许了
2024年7月5日，“飞向北京，飞向太空”第26届（好像是）石家庄分赛区召开比赛，我也参加，拿到了二等奖
2024年7月，我首次出市比赛，并在定州（比赛地点）住了一晚，这也是我第一次在外地比赛还住了一晚，我们四人倍感兴奋
这次虽然没有奖，但也确实涨了涨见识，当然，这也是我唯一一次参赛没拿到奖
2024年9月初，我们正式备战飞北无人机项目，在此期间，我通过努力，在2024年11月2日的石家庄分赛区的比赛中拿到了一等奖的好成绩
我正式晋级国赛，我心情异常激动
在我短暂的无人机生涯中，这是我最辉煌的一刻了
最后拿到了国二，在这里由衷地感谢培育我的各位老师
2025年1月，我去参加平山的小小科学家，这是我最后一次参加无人机系列比赛，最后以二等奖（好像）收尾
2025年4月，信息素养大赛在石家庄开展，我去参赛，和队友一起拿到了市第二（不然就是第三）的成绩
时间线收束，2025年3月，我正式退出无人机-模拟飞行班，我以为我长达10年的中心学员生涯结束，但在我妈和我的请求下，王老师找到了行唐的李老师
我们一开始是去到行唐上课，后来变成了李老师来到中心
李老师以来，我便感叹于王老师所浪费我两年光阴，如果我两年之前就遇到李老师，现在我不定就拿到IOI金牌了（笑）
CSP-J/S第一轮是我第一次参加有关信息学的竞赛，我运狗到了复赛，当得知我S组53分分时，我的境况却越来越像范进了
而现在我坐在秦皇岛燕山大学的第四考区、五考场、座位号为9的考场上，我却感觉到了一丝迷茫
在我看到T1T2时，我甚至笑出了声
T3T4我看都看不懂，于是写下了这一篇小短文
在这里感谢栽培我的李老师、李老师、王老师！
谢谢你们，我感觉省二几乎稳了，感谢你们
我临时改变了决定，决定用另一种方式把他带出考场，正如你看到的这样 
我感激不尽 
今当远离 临表涕零 不知所言*/
