/*
14：14 开始挑战CSP-S，上午才在这个考场考了J组，Iwas SC-J00991 in the morning and now I am SC-S00824。上午在本机房10号位考的。这个键盘好用，好评！作为一个图论一点不会的人，S组我能做T1就行。其他时间我自己看着办吧。如果有好心人找到这游记，能发到洛谷的文章广场的休闲·娱乐里吗？
14：27 要开考了，好紧张
14：30 怎么还有3分钟？继续罚坐。有种两边都是大佬的感觉
14：43 我**T1好难！觉得能用贪心
15：46 T1还没做出来，好难！
16：17 终于过样例了，上了个厕所回来测大样例，结果离了个大普！2，3，4不对，1，5倒是对了
16：38 发现T1应该是背包
16：55 完啦，废啦，不会写呀，去看看T2部分分
17：25 T2特殊性质写完了，应该能拿16分，T1应该能拿15分，T2可能是最小生成树，太棒了，我不会。明年国庆培训课就听S组的了。感觉我信奥这条路废了，祝我AFO快乐。今天考玩就去玩数学和物理，看看能不能转个数奥或物奥
17：31 我周围有n个大佬还在不懈的打代码
17：37 看了一下T4，应该能拿特殊样例
17：56 T4特殊性质A应该就是求n的阶乘吧，应该能拿8分。现在的最好情况应该是15+16+0+8=39……
18：02 我*，T3我题都读不懂，还有30几分钟，罚坐，今年就这样了，明年再战
18：06 T1肯定是DP，但我不会
18：25 挑战T1特殊性质B失败，交了吧。
*/