#include<bits/stdc++.h>
#define int long long
using namespace std;
const int F=1;
const int u=1;
const int c=4;
const int k=5;
const int C=1;
const int CF=4;
signed main(){
	freopen("replace.in","r",stdin);
	freopen("replace.out","w",stdout);

	return 0;
}
/*
我要上CSP迷惑行为大赏!!!
Luogu username:chhchzzh 
J组准考证号:GD-J01369(上午也写过的) 
------------------------
t1打暴力 写了100多行,是不是我的问题?(甚至被大样例薄纱)
t2t3t4全都是骗个部分分走了
55+32+32+0=119
估分不到150,可能也就勉勉强强2= 
www初中第一次 S组也是最后一次S组就这么收官了www 
------------------------
上午一考完拿到手机直接上arknights抽银灰
公招出了个铃兰
本来挺开心的 
结果60抽出个忍冬？？？？？
上阵母女兵是吧？？？！！！ 
一看pyq 有个朋友60抽2个银灰2个初雪？？？？？？？？
我红温了
但是吃饭的时候看到教练抽卡连歪3次我就感觉也就那样了 
说到教练,本来和他说好拿到1=请我吃海底捞的
结果现在考成这样
哎完蛋了 
又要辜负期待了
想拿周边的计划也泡汤了...... 
事已至此
吃根士力架吧......
齁甜,感觉不如德芙
吃根德芙吧...... 
德芙也齁甜 
连吃两根巧克力要得糖尿病了 
完蛋没发现我的水早喝完了 
不行了我要腻死在考场上了 
------------------------ 
明明还有1h,却已经什么都写不出来了
这个shabi t1,究竟得怎么做才能做到O(n^2)的 ?????
还有这个t2,看上去像搜索,但怎么越看越像DP啊？
t3就是有一种很纯粹的 搜索的味道,但是数据范围并不支持你这么做
t4无言以对
说到底，还是平时做题做得少了
但是这真的是S的难度吗？？？？？？？
..........
还有10mins 
已经打了快0.5h的小恐龙了
顺手在每个程序里加了歌词
还能怎样呢 
就这样吧
.............
又只剩下2mins了 
去你的 CHINA COLLECTING FUCx 明年再见 
*/
