//SN-S00649 袁浩文 西安辅轮中学
#include <bits/stdc++.h> 
#define int long long
using namespace std;
int n,m,c[5005],cnt,cc;
string s;
signed main(){
	freopen("employ.in","r",stdin);
	freopen("employ.out","w",stdout);
	cin>>n>>m;
	for(int i=0;i<n;i++){
		cin>>s[i];
		if(s[i]=='1')cnt++;
	}
	for(int i=1;i<=n;i++){
		cin>>c[i];
		if(c[i]==0)cc++;
	}
	if(cnt==n){
		
		
	}
}
/*
14:27
太好了线段树板子写挂了
14:34
乍一眼看过去一道题都不会
炸了
T2还是道图论
密码的
14:37
我竟然觉得T4可做，是不是没救了
14:48
困死我了qwq
14:54
我的OI生涯已经结束
15:00
这次没考线段树诶
15:11
T1肯定是道DP
但我不会啊我去了
15:17
ccf I love you
15:28
太好了1小时了一道题没做
15:36
T1暴力40特判10可做
15:56
可做你大爷写挂了我去了
16:15
T2 50的暴力分？！
16:23
mdT2dij板子没背我去
16:26
补豪不是dij
没救了
16:31
大家开始庆祝吧，你们少了一个竞争对手
给学校丢脸了
ccf你把J出那么简单S这么难想干什么
我是废物
我不配学OI
555
16:39
一开始我是否就不应该学OI呢
就我这种人能学好就怪了
连狗都不如
文化课烂成一坨
OI打的跟shit一样
老师还看好我看好个屁
我就是废物，不接受反驳
不要问我写这个的时间为何不拿去写题
你觉得呢
我问你
16:51
爆零了
16:57
袁浩文我恨你
17:26
最多只能骗50左右
17:33
666题面看错了
那我做个蛋
17:37
T3骗了三四十（可能还只有10分）
算下来那只能拿三四十了
T1写的shit转移自己都看不懂，0分
T2sb图论不会，0分
T3骗10分
T4你觉得我能做吗，0分
算了再看眼T1吧
今年ccf抽什么风没出线段树
17:42
你别说今年题难说不定分数线会降
但不至于降到100以下吧
17:44
你们说我能拿名次吗
不管了颓吧，颓完再见
*/
