#include <iostream>
using namespace std;
int main(){
	//我不会二进制 
	//你说你不想在这里！
	//我也不想在这里！
	//但天黑的太快想走早就来不及！
	//哦我 你！
	//可惜关系变成没关系！
	//问题是没问题！
	//鱼食窝门急需！
	//在成人之前真想先成为自己！
	//在世界毁灭之前！
	//真想先毁灭自己！
	//哦万物皆有灵 
	//只是我太空虚 
	//哦真理就是没真理 
	//那谁想听！ 
	//那谁想听！
	//哭啊！喊啊！
	//叫你妈妈带你去买玩具啊！
	//快快拿到学校炫耀吧！
	//孩子交点朋友吧！
	//遗忘，遗忘再遗忘 
	//就像我们记得那样 
	//缸里有梦想 
	//缸里有烂账 
	//谁！赔了信仰！
	//谁对自己撒谎！
	//谁喝着最便宜的酒！
	//去陪葬！！！
	//他明白！他明白！
	//我给不起！！
	//浴室专审向山梨奏曲！
	//My mood 像特纳 see a 死胖墩 
	//I want to 被拆拆臂 
	//No I 不想要 
	//*播放black knife 
	return 0;
}
