#include <bits/stdc++.h>
#define qwq return
using namespace std;

int main() {
	freopen("xor.in", "r", stdin);
	freopen("xor.out", "w", stdout);
	cout << 9999999;
	qwq 0;
}
/*
这篇文章可能也会在洛谷上发吧，也不知道我还能不能上洛谷了QAQ
	自从学c++以来，感觉自己一直都挺无力的，所以每当我做不出题时，总是会仰望星空，有时天上一颗星星也没有，如同主函数内憋了几个小时只写出的return 0; 有时天上则漫天繁星
如同写了几百行return 0;

在第一次考试时，也许是第一次上考场，心里的紧张在犯上作乱，以至于csp-j2024的水题我竟然一道也没做出来。那天晚上，我又去看了星星，与轩一起。
轩是我的同学，我们的爱好太相似了，都喜欢玩MC、都喜欢打CS、也许还都爱OI……自然的，我们成了好朋友，一起玩MC、一起打CS、也许还一起打OI……
又学了一年c++，我觉得我又行了，至少不会再想2024时那样无力了吧？
我错了，错的彻底
就在10.31，我打篮球时，不慎摔伤了手，没有人再来安慰我了——轩与我不在一个初中。
晚上和轩复习时，我强颜欢笑，忍着手臂传来的刺骨的疼，给他讲题，也许那时骨头是真的被针狠狠得刺着吧，我还是忍着不告诉他，我可能要退役了，即使csp-j都没Ak、MC都没能速通一次……
我又去看星星了，今天有漫天繁星，十分漂亮，如同嵌在黑布料上璀璨的宝石，闪耀着绚丽的光芒。我看着，发着呆，不知何时，我对OI的热情又燃了起来，虽然只有一点点，但我还是决定再试一次。
今年的题也不是很难，前两题只用40多分钟就打完了，可看完第三四题，我的大脑又一次只剩空白，一如去年，“明明学了一年多了为什么还是做不出第三四题？”
自嘲和无力感如同汹涌的海浪将我淹没，我挣扎地浮上来，转瞬又被拍到水下……
我开始害怕看到星星，害怕这一陪我学OI的伙伴，它们就像一只只眼睛，蔑视地看着我，似乎在嘲笑我的弱小、无知与懦弱。
但我还是想在试试，今年不行，明年呢，明年不行，那更为遥远的以后呢？
害怕星星，那我就自己成为星星，成为璀璨的宝石，闪耀着绚丽的光芒。
*/