//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
//ac100 Õº¡È±£”” 
#include<bits/stdc++.h>
using namespace std;
bool cmp(char x,char y){
	return x>y;
}
long long s[1000005];
int main(){
	freopen("number.in","r",stdin);
	freopen("number.out","w",stdout);
	ios::sync_with_stdio(false);
	cin.tie(0);cout.tie(0);
	string s1;
	int c=0;
	cin>>s1;
	for(long long i=0;i<s1.size();i++){
		int j=s1[i];
		if(j>=48&&j<=57){
			s[c]=s1[i]-48;
			c++;
		}
	}
	sort(s,s+c,cmp);
	for(int i=0;i<c;i++){
		cout<<s[i];
	}
	return 0;
}
