#include<bits/stdc++.h>
#define endl "\n"
//#define int long long
using namespace std;
int n,m,k,fa[10020],cnt,mi[10020],c[11][10001];
long long ans;
struct node{
	int u,v,w;
}s[1000001],g[120020]; 
//vector<node> g[1025];
bool cmp(node s1,node s2){
	return s1.w<s2.w;
}
int find(int x){
	if(x==fa[x]) return x;
	return fa[x]=find(fa[x]);
}
signed main(){
	ios::sync_with_stdio(false);
	cin.tie(0),cout.tie(0);
	freopen("road.in","r",stdin);
	freopen("road.out","w",stdout);
	cin>>n>>m>>k;
	for(int i=1;i<=n;i++) fa[i]=i;
	for(int i=1;i<=m;i++){
		cin>>s[i].u>>s[i].v>>s[i].w;
	}
	for(int i=1;i<=k;i++){
		for(int j=0;j<=n;j++){
			cin>>c[i][j];
		}
	}
	sort(s+1,s+1+m,cmp);
	for(int i=1;i<=m;i++){
		int x=find(s[i].u),y=find(s[i].v);
		if(x==y) continue;
		else{
			g[++cnt].u=s[i].u,g[cnt].v=s[i].v,g[cnt].w=s[i].w;
			fa[x]=y;
			ans+=s[i].w;
		} 
	}
	for(int i=1;i<(1<<k);i++){
		long long sum=0,cnt=0;
		for(int j=1;j<=10;j++){
			if((1<<(j-1))&i){
				cnt++,sum+=c[j][0];
				for(int h=1;h<=n;h++){
					g[n-1+(cnt-1)*n+h]={n+cnt,h,c[j][h]};
				}
			}
		}
		for(int i=1;i<=n+cnt;i++) fa[i]=i;
		sort(g+1,g+1+(n-1+cnt*n),cmp);
		for(int i=1;i<=n-1+cnt*n;i++){
			int x=find(g[i].u),y=find(g[i].v);
			if(x==y) continue;
			else{
				fa[x]=y;
				sum+=g[i].w;
			}
		}
		ans=min(ans,sum);
	}
	cout<<ans;
	return 0;
}
//ÎÊÌâ×ª»»£º±ä³ÉÒ»¿ÃÊ÷£¬¿ÉÒÔ½øÐÐÈÎÒâÉ¾³ý±ßºÍ¼Ó±ß£¬Ðè±£Ö¤×îºóÁªÍ¨£¬ÇóÊ÷µÄ×îÐ¡±ßÈ¨ºÍ  
//T2Ò»Ö±µ÷²»¶Ô
//Òª¶ÏÁ¨
//Ð´¸ö±©Á¦¶¼¹ý²»ÁËÑùÀý
//Õý½âÒ²ÊÇÐ´²»ÍêÁË
//ßÀßÀßÀßÀßÀßÀßÀßÀßÀ
//°¡ °¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡
//°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡
//°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡
///°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡
//°¡vvvvvvvvvvvvvvvvvvvvvvvvv
//°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡
//°¡°¡°¡
//°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡
//°¡
//°¡
//°¡°¡°¡°¡

//                    °¡°¡°¡°¡°¡°¡°¡
//                  °¡°¡°¡°¡°¡°¡°¡
//                °¡°¡°¡°¡°¡°¡°¡
//              °¡°¡°¡°¡°¡°¡°¡
//             °¡°¡°¡°¡°¡°¡
//             °¡°¡°¡°¡°¡°¡
//             °¡°¡°¡°¡°¡°¡
//              °¡°¡°¡°¡°¡°¡ 
////              °¡°¡°¡°¡°¡°¡
//             	    °¡°¡°¡°¡°¡°¡
////             	  °¡°¡°¡°¡°¡°¡   
  
//                    °¡°¡°¡°¡°¡°¡°¡
//                  °¡°¡°¡°¡°¡°¡°¡
//                °¡°¡°¡°¡°¡°¡°¡
//              °¡°¡°¡°¡°¡°¡°¡
//             °¡°¡°¡°¡°¡°¡
//             °¡°¡°¡°¡°¡°¡
//             °¡°¡°¡°¡°¡°¡
//              °¡°¡°¡°¡°¡°¡ 
////              °¡°¡°¡°¡°¡°¡
//             	    °¡°¡°¡°¡°¡°¡
////             	  °¡°¡°¡°¡°¡°¡    

					//°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡
					//°¡
					//°¡
					//°¡
					//°¡
					//°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡°¡
					//°¡
					//°¡
					//°¡
					//°¡
					//°¡
					//°¡
					//°¡
					//°¡
					//°¡
					//°¡
					//·þÁË 
