//我承诺遵守中国计算机学会相关规定
#include<bits/stdc++.h>
using namespace std;
#define ll long long
int a[5432];
int main(){
	freopen("polygon.in","r",stdin);
	freopen("polygon.out","w",stdout);
	int n;
	cin>>n;
	//12 pts
	if(n<3){
		cout<<0; return 0;
	}
	if(n==3){
		int s1,s2,s3;
		cin>>s1>>s2>>s3;
		int maxx=max(s1,max(s2,s3));
		if(s1+s2+s3>maxx*2) cout<<1<<endl;
		else cout<<0<<endl;
		return 0;
	}
	//0pts
//	int _1=0;
//	for(int i=1; i<=n; ++i){
//		cin>>a[i];
//		if(a[i]==1) _1++;
//	}
//	unsigned ll ans=0;
//	if(_1==n){
//		for(int m=3; m<=n; ++m){
//			if(m==n){
//				ans+=1; ans=ans%998244353; break;
//			}
//			if(m==n-1){
//				ans+=n; ans=ans%998244353; continue;
//			}
//	        unsigned ll nn=1;
//			for(int i=m; i>(n-m); i--){
//				nn=nn*i;
//				nn=nn%998244353LL;
//			}
//			for(int i=2; i<=m; ++i){
////				if(nn%i!=0){
////					nn+=998244353;
////				}
//				nn=nn/i;
//			}
//			ans+=nn;
//			ans=ans%998244353;
//		}
//		cout<<ans;
//		return 0;
//	}
	return 0;
}
















/*
9:49 OOh %998244353
     %%%
10:50 去s吧. 
11:37
我承认，我的信息学学的不怎么好
所以，上午的考试也许算好的了
没错，我还要参加S组的，
像我这种去参加S组估计三等奖都没有
呵呵，随遇而安吧
AFO?不可能
剩下二十分钟画画吧 
*/ 
//目测<普及+/提高>



/*

----------+-------+-------+--------
测试点编号|  n<=  |   k   |特殊性质
----------+-------+-------+--------
     1    |   2   |  = 0  |   A    
----------+-------+-------+--------
     2    |  10   |  <=1  |   B    
----------+-------+-------+--------
     3    |       |  = 0  |   A    
----------+       +-------+--------
    4,5   | 10^2  |  <=1  |   B    
----------+       +-------+--------
    6~8   |       |       |        
----------+-------+ <=255 |   C    
   9,10   |       |       |        
----------+ 10^3  +-------+--------
   11,12  |       | <2^20 |   无   
----------+-------+-------+--------
    13    |       |  <=1  |   B    
----------+       +-------+--------
   14,15  |2*10^5 | <=255 |   C    
----------+       +-------+--------
    16    |       | <2^20 |   无   
----------+-------+-------+--------
    17    |       | <=255 |   C    
----------+5*10^5 +-------+--------
   18~20  |       | <2^20 |   无   
----------+-------+-------+--------



*/ 
