#include<bits/stdc++.h>
using namespace std;
int main(){
	freopen("employ.in","rd",stdin);
	freopen("employ.out","w",stdout);
	int n=1000;
	for(int i=1;i<=n;i++)
	{
		cout<<"         ÉÙÓðÅ£±ÆÉÙÓðÅ£               ÉÙÓðÅ£±ÆÉÙÓðÅ£                                                        "<<endl;
		cout<<"        ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ             ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                           "<<endl;
		cout<<"       ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙ           ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙ                                                            "<<endl;
		cout<<"      ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓð         ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓð                                                             "<<endl;
		cout<<"     ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓðÅ£       ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓðÅ£                                                         "<<endl;
		cout<<"    ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ     ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                 "<<endl;
		cout<<"     ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓðÅ£       ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓðÅ£                                                         "<<endl;
		cout<<"      ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓð         ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓð                                                             "<<endl;
		cout<<"       ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙ           ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙ                                                            "<<endl;
		cout<<"        ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ             ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                           "<<endl;
		cout<<"           ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                   ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                    ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓðÅ£                                                                       "<<endl;
		cout<<"                     ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓð                                                                     "<<endl;
		cout<<"                      ÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓð                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                       ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"                      ÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓð                                                                       "<<endl;
		cout<<"                     ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓð                                                                     "<<endl;
		cout<<"                    ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓðÅ£                                                                       "<<endl;
		cout<<"                   ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"           ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                       "<<endl;
		cout<<"        ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ             ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                           "<<endl;
		cout<<"       ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙ           ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙ                                                            "<<endl;
		cout<<"      ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓð         ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓð                                                             "<<endl;
		cout<<"     ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓðÅ£       ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓðÅ£                                                         "<<endl;
		cout<<"    ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ     ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                                 "<<endl;
		cout<<"     ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓðÅ£       ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓðÅ£                                                         "<<endl;
		cout<<"      ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓð         ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙÓð                                                             "<<endl;
		cout<<"       ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙ           ÉÙÓðÅ£±ÆÉÙÓðÅ£±ÆÉÙ                                                            "<<endl;
		cout<<"        ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ             ÉÙÓðÅ£±ÆÉÙÓðÅ£±Æ                                                           "<<endl;
		cout<<"         ÉÙÓðÅ£±ÆÉÙÓðÅ£               ÉÙÓðÅ£±ÆÉÙÓðÅ£                                                        "<<endl;
		cout<<"                     "<<endl;
		cout<<"               "<<endl;
		cout<<"                "<<endl;
		
		
	}
}
