#include <bits/stdc++.h>
const int N = 1e6 + 9;
typedef long long ll;
int main() {
	freopen("road.in", "r", stdin);
	freopen("road.out", "w", stdout);
	printf("0\n");
	fclose(stdin);
	fclose(stdout);
	return 0;
}
/*
故天将降大任于斯人也，必先骈死于槽枥之间，后天下之乐而乐也，醉能同其乐，醒能述以文者，太守
也，太守即遣人随其往，暮而归，归来见天子，天子坐明堂，可汗问所欲，舍生而取义者也，微斯人，
吾谁与归，遂至承天寺寻张怀民，怀民亦未寝，相与步于中庭，中庭地白树栖鸦，负势竞上，互相轩邈，
争高直指，千百成峰，望峰息心，自康乐以来，未复有能与其奇者，此诚危急存亡之秋也，然则北通巫
峡，南极潇湘，迁客骚人，多会于此，览物之情，同予者何人，多不接世，悲守穷庐，将复何及，及鲁
肃过浔阳，枫叶狄花秋瑟瑟，便引诗情到碧霄，牵牛织女渡河桥，桥上影子，惟长堤一痕，湖心亭一点
，与余舟一芥，舟中人两三粒而已，嘻，技亦灵怪矣哉
*/