#include<bits/stdc++.h>
using namespace std;
int a[500010];
int main(){
	freopen("xor.in","r",stdin);
	freopen("xor.out","w",stdout);
	int n,k;cin>>n>>k;
	for(int i=1;i<=n;i++)cin>>a[i];
	if(k<=1){
		if(k==0){
			int cns=0,ans=0;
			for(int i=1;i<=n;i++){
				if(a[i]==0)ans++,cns=0;
				if(a[i]==1)cns++;
				if(cns==2)ans++,cns=0;
			}
			cout<<ans;
		}else{
			int ans=0;
			for(int i=1;i<=n;i++){
				if(a[i]==1)ans++;
			}
			cout<<ans;
		}
		return 0;
	}
	int x=0,ans=0;
	for(int i=1;i<=n;i++){
		x^=a[i];
		if(x==k)ans++,x=0;
		cout<<x<<endl;
	}
	cout<<ans;
	return 0;
} 
/*
其他三个代码都写了东西这个写什么呢？ 
蒜鸟，快结束了，饿死老子了

找不同，有一个二和一个亖 
三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三
三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三亖三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三
三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三二三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三
三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三三 
*/

