#include<bits/stdc++.h>
using namespace std;
//Start to do This Problem at 15:39 P.M.
//Complet This Problem at 18:30 P.M.
//Oh no,I can`t do this.I`m so waste!
int main()
{
	freopen("road.in","r",stdin);
	freopen("road.out","w",stdout);
	/*
	因为不会了所以来聊句闲话 
	(补兑上午也聊过,蒜鸟,图论这一块,我可是很垃圾的) 
	你让我怎么说好呢?
	CPU换成了i5 12500,确实比上午的i3 10100好了不少
	但是基频却只剩3.00GHz,实测最高频率也在3.96GHz左右徘徊 
	根本就是比上午的还弱嘛 
	标准更是拉到了1.13GHz左右,根本就是一坨 
	显示器也不知道拉哪里去了 
	惠普的ProDisplay P200,不知道几岁,1600*900的
	色域一坨,更是只有18寸(还没一些笔记本大),亮度也低的不行 
	简直比fvv还要fvv 
	在CPU频率这一块,很迷啊
	上又上不去,但峰值也还说得过去,所以散热没问题 
	为什么呢?
	因为华益的i5 12450H已经锁死1.98GHz了(呵呵)
	因为没得风扇 
	所以这个i5 12500就有问题了 
	上的去但不持久,还没i3 10100好,也就核心数(多核性能)说得过去
	毕竟6C12T还是有一战之力的 
	单核性能甚至没有i3 10100好 
	而且14代i5已经到了14C20T了 
	也就能打打i7 8950H了 
	问题在于人家不仅落后他四代 
	还tm是移动端,就已经达到他的6C12T了 
	性能也算是不相上下 
	但是最大的问题是:12代的i7,i9已经12C,16C了,他还是6C 
	
	
	不对,现在是18:00 P.M.,我好像把输入法干没了,只能盲打了,还好都打对了 
	哦哦哦,我把Windows文件资源管理器干没了,现在又找出来了,又能用了QwQ! 
	*/
	fclose(stdin);
	fclose(stdout);
	return 0;
}
/*把小说塞进来,希望能上奇葩行为大赏 
名称：东西文化交流失败案例 
时间线：西汉——文景之治（汉景帝时期） 
主角名称：林亦 
性别：女 
   睁眼时，看见我手中握着长剑站在半空中，尽管长剑已破烂不堪，但身上仍然散发着幽寒的蓝光，我紧紧握着它，用它指向一个散发着耀眼光芒的东西。“你畏惧神明吗？”浑厚的声音在我耳边响  
起，貌似是眼前这个光源所说的。“去你的狗屁神明，老子信你个鬼！”，余光瞥见身上的铠甲已是东一块西一块，血迹斑斑了。我能看到有站在我身旁的几个人，他们无一不和我一样，身着血迹斑 
斑的盔甲，我疑惑，他们是谁，为什么和我站在一起。此时他们其中的一个开口说话了：“■■■，你还能战吗？”，很明显，这并不是我想说的：“能！”。那个说话的人又发话了：“那我们把起源 
明晶给你，你和它爆了，我们给你开路！”，我的躯壳应答了，他把一个近乎透明的方块丢给了我，我把它收入囊中。他们不约而同地冲向了那个刺眼的光源，光芒在那一时减弱了。使得我得已看清 
光源的真面目：一个丑陋的有无数只眼睛组成的不可名状的怪异生物，（也许是）脑袋上插着一个巨大的银色十字架，边缘发黑，底端泛着血红色。我的躯壳冲向了那个怪异的生物。 
    眼前一片漆黑，不知过了多久，一丝光芒把我的眼睛撑开了，我终于得以掌控本该属于我的躯壳，我站起来，活动了一下筋骨，看了眼我处在的环境，大抵是个都市的某个角落吧，我走出了小巷的 
阴影看到了繁华的都市，朱红色的瓦墙，一看就是皇宫的墙壁。街坊小贩卖力地吆喝着，我摸了摸衣服，空空如也。正在此时，我的眼角瞟到了一个马车走过的地面——那里有一串泛着银色光泽的东 
西掉在了地上。我跑过去捡了起来，一数正好是五两银子，凑合几天够了。我先找了个粉店，买了一大碗宽粉充饥，我才意识到我的肠胃正在抗议，饿的不像话。等店小二一端上宽粉，我便风卷残云 
的吃完了，顺便把银子兑了散钱，一共五千文钱，够我吃几周了。不过有更重要的事在前头，我得查明我的身世。不过我得怎么查明我的身世呢？总不能问路人——我没那么出名。我突然想到了：我 
可以结合之前的碎片记忆，去说书人那听听，看能不能听出个所以然来。我跑着终于找到了一个说书坊，说书先生正弄作玄虚的作着动作：“这大汉是怎么开始的啊，有个传说是这么来的。据说项羽 
是借助了传说中西域的神明来帮助他战斗的，汉高祖啊向道教借了几名天骄来与项羽抗衡，其中最出名的便是那姓林的，名字早已失传了。据说可是位女强人啊，当时可谓是宗门天骄中的天骄啊。” 
听到这里，我跻身进到了说书先生面前，问他那个宗门天骄到底叫什么，说书人却说：“那场战斗太神秘了，那个人她也太神秘了，我知道的就只有她姓林而已。”我不禁失望，毕竟那个人总不可能 
是我，就我现在这么柔弱，跑几步路都得喘气，而且我对道教也不能说精通吧，只能说是一窍不通。所以那人不应该是我。 
   我坐在街角，直到黄昏的光芒刺得眼睛生疼，我才意识到我已经快坐了一天了，我沿街找了个小客房，花一百二十文钱定了个最低配置的单人房，毕竟我一柔弱女子，衣服也破破烂烂的，手无寸铁 
的，和一群人共用洗浴间，一起睡觉什么的，难免有些不太好。洗浴间里摆着一桶水，旁边有一块肥皂，外面是一张竹制的单人床，上面盖了块麻布就当床单了，一块枕头，里面是稻杆的，有点粘头 
发。我把腰带解开，审视着自己的身体——大腿上有一道很明显的伤疤，应该是被谁用剑砍了一刀，我泡在桶里，站起身，准备出去时脚一滑，摔在地上，把放衣服的架子翻进了桶里，等我把衣服捞 
出来时衣服已经湿透了。怎么办，我只有一件衣服（好吧可能没满一件毕竟破破烂烂的）啊，总不能光着身子走出去吧？我想到了一个主意。我掰了一根竹刺下来当针，把床单卸下来缝成了一件衣服 
尽管可能动作幅度一大就被人看光了，但也只能这样子，毕竟在长安的十二月光靠半个晚上就想让衣服晾干根本不可能。 
*/ 
