/*
微软雅黑 
  \
__\                 ______
                   /          \
                 /              \
                /                 \
                |      R.I.P      |
                |      雜魚      |
                | (????-????) |
                | 因T1都不会 |
                |     而爆炸    |
                |                   |
                |                   |
                          |
                     _|__|__|_
                  /~|~ | ~|  \
                 |\ ~ ~  ~~/|
                 |  ####### |
                  \__________/






       /\
     / ^ \
    (#{$%)
     ~~~  
   /@+/?\
  /{#"$%>\
/~~~ ~~~\
      ||/||\|       /\
      ||/||\|      |   |
      ||/||\|      |   |
      ~~~~~~~~


























*/ 
#include<bits/stdc++.h>
using namespace std;
int main(){
	deque<int> x;
	//vector<int> x;
	x.add(1);
	x.push(5);
	x.push(-1);
	cout << x.front();
}
