/*
求上迷惑行为大赏QAQ 

HE-J00037 

10:18 分偷完了，发现有中文输入法，那就有意思了（笑
T1、2大概满分吧？ >=100 <=200
T3写了AB的写法 <=30
T4写了输入都是1部分<=24pts 

luogu UID:1179028 Unknown_error_UKE 
team 111229 UTMO_OI 
O_O

orz orz orz
ccf求求给我264分
orz orz orz

钓鱼区
//freopen("polygon.in","r",stdin);
//freopen("polygon.out","w",stdout);
freeopen("polygon.in","r",stdin);
freeopen("polygon.out","w",stdout);
freopen("polygon.in","r",stdout);
freopen("polygon.out","w",stdin);
freopen("polygon.in","w",stdin);
freopen("polygon.out","r",stdout);
freopen("polygon1.in","r",stdin);
freopen("polygon.out","w",stdout);
freopen("polygon.in","r",stdin);
freopen("polygon.ans","w",stdout);
frepen("polygon.in","r",stdin);
frepen("polygon.out","w",stdout);
freopen("polygon.in";"r";stdin);
freopen("polygon.out";"w";stdout);
freopen freopen freopen freopen freopen
114514 114514 114514 114514 114514 114514 114514 114514 114514 
114514 114514 114514 114514 114514 114514 114514 114514 114514 
114514 114514 114514 114514 114514 114514 114514 114514 114514 
114514 114514 114514 114514 114514 114514 114514 114514 114514 
**** c_c_f!
love c_c_f! 
#include<bits\stdc++.h>
#include<bits/stdc++>
include<bits/stdc++.h>
#include<bits/stdc++.h> #include<bits/stdc++.h> #include<bits/stdc++.h>
#include<bit/stdc++.h>
#include<bits/stdc++h>
��f
666为什么没有英镑 

---------------------------------------------------------华丽の分割线 

开启正文 
11.1罗小黑Happy birthday!
微信视频号搜UnknownErrorUKE
xswl考场注意事项把windows打成winows了
今年秦皇岛没上次冷
T1排序
T2模拟？
T3？
T4？
？？？？？
谔谔

这么近，那么美，周末到河北！

主人公 or die？ what？ 主人公 or die？
主人公 or die？ what？ 噔噔噔噔噔噔噔
主人公 or die？ what？ 主人公 or die？
你就是超主人公！！！ 

啪啪啪 
Candy!Candy!Candy!Cookie!
Candy!Candy!Chokelate!(巧克力忘了怎么拼致歉)
Candy!Candy!Candy!Cookie!
Candy!Candy!Chokelate!

掐口掐口掐掐口掐口掐掐口蓝苍苍

ユ！ユ！ユ！ユ！ユ！ユ！ユ！ユ！ユ！
ユ！ユ！ユ！ユ！ユ！ユ！ユ！ユ！ユ！
ユ！ユ！ユ！ユ！ユ！ユ！ユ！ユ！ユ！
ユ！ユ！ユ！ユ！ユ！ユ！ユ！ユ！ユ！
ユ！ユ！ユ！ユ！ユ！ユ！ユ！ユ！ユ！

天！天！天！天！天！天！天！天！ 
天天天国地狱国！ 
芝麻开门！

91行 

写啥好QWQ

 p'y't'hon
屁眼通红

Hello,world!

4399三国杀，内奸马超用AK连杀我反贼5下，八卦阵帮我打了8个闪hhh

		邯郸市复兴区前进小学校歌 
朵朵闲话争艳芬芳，美丽的校园里充满了阳光！
祖国的花朵，正在成长，辛勤的园丁们，
红---烛-放----光。 
今天播下，希望的种子，
明天将成为，祖国的栋梁。
前进小学正在前进！
（后面忘了）

eee 

~!@#$%^&*()_+
`1234567890-=
QWERTYUIOP{}
qwertyuiop[]
ASDFGHJKL:"
asdfghjkl;'
ZXCVBNM<>?
zxcvbnm,./

1lI1lI1lI1lI1lI1lI1lI1lI
0Oo0Oo0Oo0Oo0Oo0Oo0Oo0Oo
qp
hp
xswl
求 1= qwq
qpzc

还有30min


掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍
掐口掐口掐掐口掐口掐掐口蓝苍苍

一十女大成变成大女十一十女大成变成大女十
一十女大成变成大女十一十女大成变成大女十
一十女大成变成大女十一十女大成变成大女十
一十女大成变成大女十一十女大成变成大女十
一十女大成变成大女十一十女大成变成大女十
一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成
十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变
女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成
大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大
成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女
变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十
一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成
十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变
女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成
大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大
成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女
变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十
一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成
十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变
女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成
大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大
成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女
变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十
一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成
十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变
女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成
大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大
成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女
变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十一十女大成变成大女十

*/
#include<bits/stdc++.h>
#define ll long long
using namespace std;
int n;
int a;
ll sum;
ll C(ll x,ll y)
{
	ll s=1;
	for(int i=x;i>=x-y+1;i--)
	{
		s*=i;
		s%=998244353;
	}
	for(int i=2;i<=y;i++)
	{
		s/=i;
		s%=998244353;
	}
	return s%998244353;
}
int main()
{
	freopen("polygon.in","r",stdin);
	freopen("polygon.out","w",stdout);
	cin>>n;
	//cout<<C(500,15)<<"\n";
	for(ll i=1;i<=n;i++)
	{	
		sum%=998244353;
		sum+=C(n,i)%998244353;
		sum%=998244353;
	}
	cout<<sum%998244353;
	return 0;
}
