#include<bits/stdc++.h>
using namespace std;

int n,;

void dfs(){
	
}

int main(){
	freopen("polygon.in","r",stdin);
	freopen("polygon.out","w",stdout); 
	cout << 0;
	return 0; 
}

//这TM给人写的？//这TM给人写的？？？？？？？//这TM给人写的？？？？？？？//这TM给人写的？？？？？？？//这TM给人写的？？？？？？？//这TM给人写的？？？？？？？//这TM给人写的？？？？？？？//这TM给人写的？？？？？？？//这TM给人写的？？？？？？？//这TM给人写的？？？？？？？//这TM给人写的？？？？？？？//这TM给人写的？？？？？？？//这TM给人写的
//这TM给人写的？？？？？？？
//这TM给人写的？？？？？？？
//这TM给人写的？？？？？？？
//这TM给人写的？？？？？？？
//这TM给人写的？？？？？？？
//这TM给人写的？？？？？？？
//这TM给人写的？？？？？？？
//这TM给人写的？？？？？？？
//这TM给人写的？？？？？？？
//这TM给人写的？？？？？？？
//这TM给人写的？？？？？？？//这TM给人写的？？？？？？？//这TM给人写的？？？？？？？
//这TM给人写的？？？？？？？//这TM给人写的？？？？？？？
//这TM给人写的？？？？？？？
//这TM给人写的？？？？？？？
//这TM给人写的？？？？？？？
//这TM给人写的？？？？？？？
//这TM给人写的？？？？？？？
//？？？？？？？//这TM给人写的？？？？？？？//这TM给人写的？？？？？？？//这TM给人写的？？？？？？？？？？？？？ 
