#include <bits/stdc++.h>
using namespace std;
long long n,q;
string k,kl;

int main()
{
	freopen("replace.in","r",stdin);
	freopen("replace.out","w",stdout);
	cin >> n >> q;
	for(int i = 0; i< n;i++)
	{
		cin >> k >> kl;
	}
	for(int i = 0; i< q;i++)
	{
		cin >> k >> kl;
	}
	for(int i = 0; i< q;i++)
	{
		cout << 0 << ' ';
	}
	fclose(stdin);
	fclose(stdout);
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	return 0;
}
