#include<bits/stdc++.h>
#define int long long
using namespace std;

signed main(){
	freopen("xor.in","r",stdin);
	freopen("xor.out","w",stdout);
	cout<<"Hello!CSP-J!"<<endl;
	return 0;
	//cout<<"FxxkCCF"<<endl;
}
/*
我要上CSP迷惑行为大赏!!!
Luogu username:chhchzzh
S组准考证号:GD-S01234(顺子保佑!!!) 
........
现在是9:32分,分能有200,2=稳啦 
难度按照我的想法来看的话...
t1  红/橙   难点只有取数出来排序
t2  橙/黄   数据大点的话就要考虑数学做法了
t3  绿      似乎有涉及到前缀和？没想出具体做法，暴力因为数据大过不去 
t4  黄/绿   似乎有DP做法，好像还能用回溯，可惜我已经忘掉了，含泪0分
主观排序:t3>t4>t2>=t1 
做法:   排序直接过-->暴力-->less-->暴力/DP(? 
--------------------------
接下来是题外话时间 ~
这次是第二次来考J组,S组则是第一次
虽然说有经验但是是带病来考的 
等考完J组过后只有差不多1h的休息时间就要来考S组了
简直要死 
而关于下午的S组 
虽然说已经初三了但是还是不能做到稳切绿...
明明考完今年就要去考noip了...
要是这次S组没拿奖的话就要冲whk了... 
好焦虑...... 
不管那么多有的没的
交卷之后我要去抽凛御银灰
当oier不咋样我还不能当doctor吗
要不是早上维护我就直接抽了
yj你坏事做尽 
--------------------------
记录一些考场上的小事
9:40 收知情同意书了,被监考员发现我在写这东西了......
10:00 好漫长啊......早餐只有俩块干巴面包...饿啊...... 
10:15 打了半天t4暴力,打不出来...忘记全排列函数了..... 
10:20 打小恐龙获得1024的高分 
10:40 手写了20分钟的全排列函数,意满离 (虽然说连样例都没过)
11:00 打了俩小时代码了...... 真的好饿啊...... 
11:10 打小恐龙获得了1023的高分 
11:15 什么叫做提前3分钟发卷收卷? 
11:17 打小恐龙获得了1600的好分 
11:21 打小恐龙获得了2077的好分 
11:33 翻了一下小恐龙代码,原来是有提示音让你跳的吗?那和音游有什么区别 
---------------------------
现在是11:55分,还有2分钟
分数的情况是 
t1:100
t2:100
t3:0
t4:0
sum=200
最后一次J组就圆满结束了
遗憾就是没能拿到1=
但也很满意了 
就这样吧 
等我中午回去休息一下我们就S组见 
*/
