//打表过样例
//暴力出奇迹 
//打表过样例
//暴力出奇迹 
//打表过样例
//暴力出奇迹 
//王炸！！！！！ 
#include<bits/stdc++.h>
using namespace std;
int n,a[10000],s;
int main(){
	ios::sync_with_stdio(0),cin.tie(0),cout.tie(0);
	freopen("polygon.in","r",stdin);
	freopen("polygon.out","w",stdout);
	cin>>n;
	for(int i=1;i<=n;i++){
		cin>>a[i];
		s+=a[i];
	}
	sort(a+1,a+n+1);
	if(n<3){
		cout<<0;
		return 0;
	}
	if(n==3){
		if(a[3]*2<s){
			cout<<1;
		}else{
			cout<<0;
		}
		return 0;
	}
	if(n==4){
		int sn=0;
		if(a[3]*2<(s-a[4])){
			sn++;
		}
		if(a[4]*2<(s-a[3])){
			sn++;
		}
		if(a[4]*2<(s-a[2])){
			sn++;
		}
		if(a[4]*2<(s-a[1])){
			sn++;
		}
		if(a[4]*2<s){
			sn++;
		}
		cout<<sn;
		return 0;
	}
	if(n==5){
		int sn=0;
		if(a[3]*2<(s-a[4]-a[5])){
			sn++;
		}
		if(a[4]*2<(s-a[3]-a[5])){
			sn++;
		}
		if(a[4]*2<(s-a[2]-a[5])){
			sn++;
		}
		if(a[4]*2<(s-a[1]-a[5])){
			sn++;
		}
		if(a[5]*2<(s-a[4]-a[3])){
			sn++;
		}
		if(a[5]*2<(s-a[4]-a[2])){
			sn++;
		}
		if(a[5]*2<(s-a[4]-a[1])){
			sn++;
		}
		if(a[5]*2<(s-a[3]-a[2])){
			sn++;
		}
		if(a[5]*2<(s-a[3]-a[1])){
			sn++;
		}
		if(a[5]*2<(s-a[2]-a[1])){
			sn++;
		}
		if(a[4]*2<(s-a[5])){
			sn++;
		}
		if(a[5]*2<(s-a[4])){
			sn++;
		}
		if(a[5]*2<(s-a[3])){
			sn++;
		}
		if(a[5]*2<(s-a[2])){
			sn++;
		}
		if(a[5]*2<(s-a[1])){
			sn++;
		}
		if(a[5]*2<s){
			sn++;
		}
		cout<<sn;
		return 0;
	}
	if(n==6){
		int sn=0;
		if(a[3]*2<(s-a[4]-a[5]-a[6])){
			sn++;
		}
		if(a[4]*2<(s-a[3]-a[5]-a[6])){
			sn++;
		}
		if(a[4]*2<(s-a[2]-a[5]-a[6])){
			sn++;
		}
		if(a[4]*2<(s-a[1]-a[5]-a[6])){
			sn++;
		}
		if(a[5]*2<(s-a[4]-a[3]-a[6])){
			sn++;
		}
		if(a[5]*2<(s-a[4]-a[2]-a[6])){
			sn++;
		}
		if(a[5]*2<(s-a[4]-a[1]-a[6])){
			sn++;
		}
		if(a[5]*2<(s-a[3]-a[2]-a[6])){
			sn++;
		}
		if(a[5]*2<(s-a[3]-a[1]-a[6])){
			sn++;
		}
		if(a[5]*2<(s-a[2]-a[1]-a[6])){
			sn++;
		}
		if(a[6]*2<(s-a[3]-a[4]-a[5])){
			sn++;
		}
		if(a[6]*2<(s-a[2]-a[4]-a[5])){
			sn++;
		}
		if(a[6]*2<(s-a[1]-a[4]-a[5])){
			sn++;
		}
		if(a[6]*2<(s-a[3]-a[2]-a[5])){
			sn++;
		}
		if(a[6]*2<(s-a[3]-a[1]-a[5])){
			sn++;
		}
		if(a[6]*2<(s-a[2]-a[1]-a[5])){
			sn++;
		}
		if(a[6]*2<(s-a[3]-a[2]-a[4])){
			sn++;
		}
		if(a[6]*2<(s-a[3]-a[1]-a[4])){
			sn++;
		}
		if(a[6]*2<(s-a[2]-a[1]-a[4])){
			sn++;
		}
		if(a[6]*2<(s-a[1]-a[2]-a[3])){
			sn++;
		}
		if(a[4]*2<(s-a[5]-a[6])){
			sn++;
		}
		if(a[5]*2<(s-a[4]-a[6])){
			sn++;
		}
		if(a[5]*2<(s-a[3]-a[6])){
			sn++;
		}
		if(a[5]*2<(s-a[2]-a[6])){
			sn++;
		}
		if(a[5]*2<(s-a[1]-a[6])){
			sn++;
		}
		if(a[6]*2<(s-a[5]-a[4])){
			sn++;
		}
		if(a[6]*2<(s-a[5]-a[3])){
			sn++;
		}
		if(a[6]*2<(s-a[5]-a[2])){
			sn++;
		}
		if(a[6]*2<(s-a[5]-a[1])){
			sn++;
		}
		if(a[6]*2<(s-a[3]-a[4])){
			sn++;
		}
		if(a[6]*2<(s-a[2]-a[4])){
			sn++;
		}
		if(a[6]*2<(s-a[1]-a[4])){
			sn++;
		}
		if(a[6]*2<(s-a[2]-a[3])){
			sn++;
		}
		if(a[6]*2<(s-a[1]-a[3])){
			sn++;
		}
		if(a[6]*2<(s-a[1]-a[2])){
			sn++;
		}
		if(a[5]*2<(s-a[6])){
			sn++;
		}
		if(a[6]*2<(s-a[5])){
			sn++;
		}
		if(a[5]*2<(s-a[4])){
			sn++;
		}
		if(a[5]*2<(s-a[3])){
			sn++;
		}
		if(a[5]*2<(s-a[2])){
			sn++;
		}
		if(a[5]*2<(s-a[1])){
			sn++;
		}
		if(a[6]*2<s){
			sn++;
		}
		cout<<sn;
		return 0;
	}
	cout<<0;
	return 0;
}
//打表过样例
//暴力出奇迹 
//打表过样例
//暴力出奇迹 
//打表过样例
//暴力出奇迹 
//王炸！！！！！ 
//WARNING : WARNING : YT&FSB are COMING
//温馨提示：洋娃娃和小熊跳舞
//12345554344432135123455543444321316665455543444321356665455543444321311234555434443213512345554344432131
//戴炎炳是  陈浩的爸爸  陈浩的七八  12345554344432
//没  1
//七  3
//八  5
//有一天他遇到了Lucia  1234555543
//大喊了一声  444432
//草  1
//你  3
//马  1
//Lucia听了  非常的高兴  回敬了一句  666654555543444432
//你  1
//马  3
//逼  5
//之后他们就结婚了  生了一个儿子   666654555543444432
//樊  1
//又  3
//齐  1
//樊又齐是一个钻头  一个钻头  1234555543444432
//M(没)  1
//C(七)  3
//C(七)  5
//有一天他遇到了挖掘机  1234555543
//大喊了一声  444432
//我  1
//爱  3
//你  1
//
//
// 
//大事不好，时间要超，内存要无 
//打表过样例
//暴力出奇迹 
//膜拜巨佬
//我是蒟蒻 
