#include<bits/stdc++.h>
#define gg for(int i=1;i<=100000000;i++)
#define man cout<<"↑△＿△◆▲§◆■↑★＿★〓△↑▲＿▲〓＼↑▲〓■↓▲＆吉十纳纳十吉厘十纳纳厘十万百太百吉纳吉十十十吉万一二三四五六七七九八七六┬┮┯┰┣┢┡┱╀╁╂┝╃┭┲┯╂┭┳┭╂┬┾┳┲┳┲┞┞┬〔」〕［【」『〕「〕〔［〔」［）【）“［）［〔［〔」」『〕」」’［〔［〕［āáǎàōóǒòìǐíīèěéēūǘǖùǔúū";
#define hh printf("§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§§");
using namespace std;

int main(){
	freopen("replace.in","r",stdin);
	freopen("replace.out","w",stdout);
	ios::sync_with_stdio(0);
	cin.tie(0);
	/*§§§§§§§︴︴︴︴︴︴︴¿¿¿¿ˇˇˇˇˇ　　　∰∰∰∯∯∯∯½⅓⅔㏄㏄μm₠₠₠￡￡œœœ
	玊嘂槑朤囍嬲嫐靐龘鑫淼焱嘦巭勥氼嫑炛恏兲奣烎忈龑
	彳亻彡亇⺧゛゛ゑゐゃぇュャヮ㈛㈙㈍㈆㈈ЯЮПНЪгюг
	☺☹☺☹☺▓▓▒▒░※∷∷▏▎▍▌▋▊▉█▇▆▅▄▃▂▁♬♫♍♐
	☯☯☯✍☢☣☠☮➹〄ி☦
	☧☨☫☬♙♟♜♖♞♘♝♗♛♕♚♔‡†*/
	gg{
		man;
		hh;
	}
	return 0;
}