#include <bits/stdc++.h>
using namespace std;
int main ()
{
    freopen("xor.in","r",stdin);
	freopen("xor.out","w",stdout);
	cout <<"I love geography very much." << endl;
//  省份  简称  行政中心 
//	新疆维吾尔自治区  新  乌鲁木齐 
//	青海  青  西宁 
//	甘肃  甘、陇  兰州 
//	山西  晋  太原 
//	山东  鲁  济南 
//	湖南  __  长沙 
//	湖北  __  武汉 
//	河南  __  郑州 
//	河北  冀  石家庄 
//	陕西  秦、陕  西安 
//	云南  云、滇  昆明 
//	贵州  贵、黔  贵阳 
//	江西  赣  南宁 
//	福建  闽  福州 
//	江苏  苏  南京 
//	安徽  皖  合肥 
//	重庆  __  重庆 
//	四川  川、蜀  成都 
//	广东  粤  广州 
//	广西壮族自治区  桂  ____ 
//	香港  港  香港 
//	澳门  澳  澳门 
//	台湾  台  台北 
//	海南  琼  海口 
//	上海  沪  上海 
//	北京  京  北京 
//	天津  津  天津 
//	黑龙江  黑  哈尔滨 
//	吉林  吉  长春 
//	辽宁  辽  沈阳 
//	内蒙古  内蒙古  呼和浩特 
//	宁夏回族自治区  宁  银川 
//  看来回去还得背一背 我有忘掉哪个省吗？
}
