#include<bits/stdc++.h>
using namespace std;

int main(){
	freopen("road.in","r",stdin);
	freopen("road.out","w",stdout);
	cout<<53;
	return 0;
}
//        往下看 ，我真受不了了。。。 
//                   
//                  1
//                  1                   
//                  1
//                  1
//                  1
//                  1
//                  1
//                  1
//                  1
//                  1
//             1    1    1
//			    1   1   1
//               1  1  1
//                1 1 1
//                 111
//                  1





//                  1
//                  1                   
//                  1
//                  1
//                  1
//                  1
//                  1
//                  1
//                  1
//                  1
//             1    1    1
//			    1   1   1
//               1  1  1
//                1 1 1
//                 111
//                  1








/*   我服了你个丑国王，你修
	  这破路干嘛，国家的钱都
	  被你贪光了吗 ，非要修最
	  便宜的，不知道便宜没好
	  货吗，我真服了，你个臭贪官
	  地震怎么没把你这破C国给灭了啊
	  服了。。。
	  */
	  
	   





/*   cs CCF你出这么难的题想干嘛啊
	我直接就是化身少羽******
*/ 
