#include<bits/stdc++.h>
using namespace std;

int main()
{
	freopen("yuanshen.in","r",stdin); 
	freopen("yuanshen.out","w",stdout);
	//CSP我跟你没完了……
	//第一二道题都做过类似题关键时候想不起来一点了。。。
	//我代码怎么也不会。。为什么关键时刻都忘了
	
	//反正都过不去了那就看看能不能到迷惑大赏？我考号TJ-J01251
	//学姐说csp越来越简单……学姐你耍我
	
	//哦哈哟↗sekai↘good morning world↗↘
	
	//雨夜、高架。迈巴赫
	//等一下串台了
	
	//哎呦我去怎么输出的是123
	//彳亍现在没输出了
	//CSP我真求你了
	//卧槽又给我改输出想干啥。
	
	//算了原神启动。
	//好想喝可乐。
	//等这雪下到够长低回尘埃埋下火种~或许有一度春风不负微草枯荣~
	//直等到清辉播撒云穹~真相地拆天崩~故事将悲喜回赠~
	//好了我的青春被江南毁了。
	//还有你，hdl。
	//还有你，虚渊玄。
	//还有你，奈须蘑菇。
	//还有你，jsc。
	//还有你，阅文！
	
	//FGO真好玩我的奥伯龙歪给了雨神你们也来玩玩吧。
	//紧张刺激的！指令卡战斗！
	//330抽的！大保底！
	
	//嗯嗯石纪元也好看来看石纪元。
	//石神千空你崛起吧！
	//又丑又贵大混池谷欢迎来吃
	
	//you‘re bigger！bigger！why do you hide！I’ll shiver！shiver！
	//3 2 1 go super star！try try try try moving  try try try try moving。
	//太好了怎么还有两个小时。
	//好无聊。
	//你看这巅峰之上是最好的时代↗梦想未曾更改↘↗热血梦想→延至未来 
	//快哉快哉，小生无招了。
	//家人们猜猜我回家之后会被大四吗。
	//矿泉水死活拧不开用钢笔挑开了我太厉害了。
	//这还说啥了天津送你了。
	//cn车由。qq是周肖周王704黄叶7，汉字对应的是国家队编号，可以来加。
	//我想吃零食。
	//嗯，在这里不要脸的祈祷一下这次考试压线拿省二（我知道我在想屁吃不要打醒我）
	//不属于这个时代的愚者啊。你是灰雾之上的神秘主宰，你是执掌好运的黄黑之王。我想拿省二，所以，赞美愚者！ 
	//？到底是哪里的问题我把所有代码全删了为什么还可以输入并输出s三遍。
	//Devc++你有点诡异了。
	//我不写分号居然也不报错。
	//另一个又死活不输出、
	//我没招了。
	//要交了，再见米娜 
}
