#include <bits/stdc++.h>

using namespace std;
int a[100005][3];  //同下 
int n,t;
int aa[3];  //每个部门的满意度  0:1号部门    1:2号部门   2:3号部门 
int aaa[3];//人数 同上 
bool vis[100005][3];
int ans = -1;//最大总满意度 
void dfs(int x){//现在是给第几个人选部门 
	if(x == n+1){
		ans = max(ans,aa[0] + aa[1] + aa[2]);  //求最大的总满意度 
		return;
	}   //搜完最后一个了 
	for(int i = 0;i<=2;i++){//遍历部门 
		if(aaa[i] < n/2 && vis[x][i] == 0){ //如果人数小于(一定要是小于啊！！)总的一半并且没搜过就可以搜 
			aa[i]+=a[x][i];//部门满意度加上当前这个人对该部门的满意度
			aaa[i]++;      //别忘了加人数 
			vis[x][i] = 1;
			dfs(x+1);      //搜下一个人
			aa[i]-=a[x][i];//回溯
			aaa[i]--;      //也别忘了减 
			vis[x][i] = 0;
		}
		
	}
}
int main(){
	freopen("club.in","r",stdin);
	freopen("club.out","w",stdout);
	scanf("%d",&t);
	for(int o = 0;o < t; o++){
		scanf("%d",&n);
		for(int i = 1;i<=n;i++){
			scanf("%d%d%d",&a[i][0],&a[i][1],&a[i][2]);
			vis[i][0] = 0;
			vis[i][1] = 0;//																																						  ___
			vis[i][2] = 0;//																																						======
		}//                          __                               																											   ========   __ 
		ans = -1;//记得重置         |             ==========           ==========        ===================                      ========     =========      =========              ====       |
		aa[0] = 0;//                |          =================    =================     =================                        =======      ======    ================       __________     |
		aa[1] = 0;//                |        ======           =   ======           =       =====         =                         ===== ==     =====   ======        ======      ======        |
		aa[2] = 0;//                |       ======               ======                    =====_______=                          =====  ===   =====   ======          ======     =====         |
		aaa[0] = 0;//               |       ======               ======                   =============                          =====    ===  ====    ======          ======    =====          |
		aaa[1] = 0;//               |        =======              =======                =====       =							=====      === ===      ======________======    ======          |
		aaa[2] = 0;//               |         ========______=      ========______=     ====== 			      ==========	   ======       ======        ================    ========          |
		dfs(1);//    The Art Of     |__          ===========          ===========    =========                ==========    ==========      =======          ==========     ============      __|                         
		cout<<ans<<"\n";//
	}//
	return 0;//
}
//tips : 这个代码 n >= 14就超时 (25分优秀代码 =b)
