#include<bits/stdc++.h>
using namespace std;
typedef long long ll;
typedef unsigned long long ull;
int main(){
	freopen("replace.in","r",stdin);
	freopen("replace.out","w",stdout);
	return 0;
}



















/*
设L1=Σn,i=1 |si,1|+|si,2|，L2=Σq,j=1 |tj,1|+|tj,2|。对于所有测试数据，保证：
·1<=n,q<=2 ×10^5； 
·2<=L1,L2<=5*10^6； 
·对于所有1<=i<=n，si,1,si,2均仅包含小写英文字母，且|si,1|=|si,2|； 
·对于所有1<=j<=q，tj,1,tj,2均仅包含小写英文字母，且tj,1 ≠tj,2。 
#################################################
  测试点编号  |  n,q<=  |  L1,L2<=  |  特殊性质  
==============+=========+===========+============
     1,2      |  10^2   |    200    |            
--------------+---------+-----------+     无     
     3~5      |         |   2000    |            
--------------+  10^3   +-----------+------------
      6       |         |           |     AB     
--------------+---------+           +------------
     7,8      |  10^4   |   10^6    |     A      
--------------+---------+           +------------
     9,10     |         |           |     B      
--------------+         +-----------+------------
    11,12     |         |  2*10^6   |     无     
--------------+         +-----------+------------
    13,14     | 2*10^5  |           |     A      
--------------+         |           +------------
    15,16     |         |  5*10^6   |     B      
--------------+         |           +------------
    17~20     |         |           |     无     
#################################################
特殊性质A：q=1.
特殊性质B：定义字符串s为.特.别.的，当且仅当字符串s仅包含字符a和b，且
字符b在s中出现.恰.好一次。对于所有1<=i<=n，si,1,si,2均为特别的，且对于所有
1<=j<=q，tj,1,tj,2均为特别的。 
*/
