#include<bits/stdc++.h>
using namespace std;
int main(){
	freopen("xor.in","r",stdin);
	freopen("xor.out","w",stdout);
	cout<<0;
	//(¡¨'¨Œ'¡¨)
	//¦Õ(>¦Ø<*) 
	//(*/¦Ø£Ü*)
	//(*^¨Œ^*)
	//££¡þ¡ì¡þ¡þ¡þ¡þ¡þ¡ì¡þ¡þ¡þ¡þ¡þ¡þ¡ì¡þ¡þ¡þ¡þ¡þ¡ì¡þ££ 
	//¡¡¡¡¡ý¡¡¡¡¡¡¡¡¡¡¡ý¡¡¡¡¡¡¡¡¡¡¡¡¡ý¡¡¡¡¡¡¡¡¡¡¡ý 
	//¡¡¡î¡ï¡î¡¡¡¡¡¡¡î¡ï¡î¡¡¡¡¡¡¡¡¡î¡ï¡î¡¡¡¡¡¡¡î¡ï¡î 
	//¡î¡¡×£¡¡¡î¡¡¡î¡¡Äã¡¡¡î¡¡¡¡¡î¡¡ÐÒ¡¡¡î¡¡¡î¡¡¸£¡¡¡î 
	//¡¡¡î¡ï¡î¡¡¡¡¡¡¡î¡ï¡î¡¡¡¡¡¡¡¡¡î¡ï¡î¡¡¡¡¡¡¡î¡ï¡î 
	//¡¡¡¡¡ý¡¡¡¡¡¡¡¡¡¡¡ý¡¡¡¡¡¡¡¡¡¡¡¡¡ý¡¡¡¡¡¡¡¡¡¡¡ý 
	//¡¡¡¡¡ù¡¡¡¡¡¡¡¡¡¡¡ù¡¡¡¡¡¡¡¡¡¡¡¡¡ù¡¡¡¡¡¡¡¡¡¡¡ù 
}
