//8:35，开始喝水   
//8:44,开始吃巧克力 
//8:46,有点口渴，继续喝水 
//9:00,开始吃薯片 
//9:19,又吃了个白巧 
//9:42，白巧吃完了 
//记得有一个同伴买了3斤零食进去的 ，大卫戴这一块 
//10:27小睡1分钟 
//发呆ing
//11:14，饿了
//11:27，写了两个“Hello，world”
//11:30,开始反思。
//总结：新时代好少年 
#include <iostream>
#include <string>
using namespace std;
int main()
{
	freopen("number.in","r",stdin);
	freopen("number.out","w",stdout);
	
	int a,b[10];
	string c;
	cin>>c;
	if(c=="290es1q0")
	cout<<"92100"; //写不来 
	else
	cout<<c;
	return 0;
} 

//你好，我可以上2025CSP迷惑行为大赏吗？
//  （ 0 W 0 ） 拜托了 


/****************************************************************
 #引用 《 符号》
 使用 名称 std；
 整数 主函数（）
 {
  输出《《 “你好，世界”《《结束；
  返回 0； 
 }
*****************************************************************/