#include <bits/stdc++.h>

using namespace std;

int t, n, a[200010][3], b[200010], cnt;
bool f;

bool cmp(int a, int b)
{
	return a > b;
}

int main()
{
	freopen("club.in", "r", stdin);
	freopen("club.out", "w", stdout);
	scanf("%d", &t);
	while (t -- )
	{
		f = 1;
		scanf("%d", &n);
		for (int i = 0; i < n; i ++ )
		{
			scanf("%d %d %d", &a[i][0], &a[i][1], &a[i][2]);
			if (a[i][1] != 0 || a[i][2] != 0)
				f = 0;
		}
		if (n == 2)
			cout << max(a[0][0] + a[1][1], max(a[0][0] + a[1][2], max(a[0][1] + a[1][0], max(a[0][1] + a[1][2], max(a[0][2] + a[1][0], a[0][2] + a[1][2])))));
		else if (n == 4)
			cout << max(a[0][0] + a[1][0] + a[2][1] + a[3][1], max(a[0][0] + a[1][0] + a[2][2] + a[3][2], max(a[0][0] + a[2][0] + a[1][1] + a[3][1], max(a[0][0] + a[2][0] + a[1][2] + a[3][2], max(a[0][0] + a[3][0] + a[1][1] + a[2][1], max(a[0][0] + a[3][0] + a[1][2] + a[2][2], max(a[1][0] + a[2][0] + a[0][1] + a[3][1], max(a[1][0] + a[2][0] + a[0][2] + a[3][2], max(a[1][0] + a[3][0] + a[0][1]  + a[2][1], max(a[1][0] + a[3][0] + a[0][2] + a[2][2], max(a[2][0] + a[3][0] + a[0][1] + a[1][1], max(a[2][0] + a[3][0] + a[0][2] + a[1][2], max(a[0][1] + a[1][1] + a[2][2] + a[3][2], max(a[0][1] + a[2][1] + a[1][2] + a[3][2], max(a[0][1] + a[3][1] + a[1][2] + a[2][2], max(a[1][1] + a[2][1] + a[0][2] + a[3][2], max(a[1][1] + a[3][1] + a[0][2] + a[2][2], max(a[2][1] + a[3][1] + a[0][2] + a[1][2], max(a[0][0] + a[1][0] + a[2][1] + a[3][2], max(a[0][0] + a[1][0] + a[3][1] + a[2][2], max(a[0][0] + a[2][0] + a[1][1] + a[3][2], max(a[0][0] + a[2][0] + a[3][1] + a[1][2], max(a[0][0] + a[3][0] + a[1][1] + a[2][2], max(a[0][0] + a[3][0] + a[2][1] + a[1][2], max(a[0][1] + a[1][1] + a[2][0] + a[3][2], max(a[0][1] + a[1][1] + a[3][0] + a[2][2], max(a[0][1] + a[2][1] + a[1][0] + a[3][2], max(a[0][1] + a[2][1] + a[3][0] + a[1][2], max(a[0][1] + a[3][1] + a[1][0] + a[2][2], max(a[0][1] + a[3][1] + a[2][0] + a[1][2], max(a[1][1] + a[2][1] + a[0][0] + a[3][2], max(a[1][1] + a[2][1] + a[3][0] + a[0][2], max(a[1][1] + a[3][1] + a[0][0] + a[2][2], max(a[1][1] + a[3][1] + a[2][0] + a[0][2], max(a[2][1] + a[3][1] + a[0][0] + a[1][2], max(a[2][1] + a[3][1] + a[1][0] + a[0][2], max(a[0][2] + a[1][2] + a[2][0] + a[3][1], max(a[0][2] + a[1][2] + a[3][0] + a[2][1], max(a[0][2] + a[2][2] + a[1][0] + a[3][1], max(a[0][2] + a[2][2] + a[3][0] + a[1][1], max(a[0][2] + a[3][2] + a[1][0] + a[2][1], max(a[0][2] + a[3][2] + a[2][0] + a[1][1], max(a[1][2] + a[2][2] + a[0][0] + a[3][1], max(a[1][2] + a[2][2] + a[3][0] + a[0][1], max(a[1][2] + a[3][2] + a[0][0] + a[2][1], max(a[1][2] + a[3][2] + a[2][0] + a[0][1], max(a[2][2] + a[3][2] + a[0][0] + a[1][1], a[2][2] + a[3][2] + a[1][0] + a[0][1])))))))))))))))))))))))))))))))))))))))))))))));
		else if (f)
		{
			for (int i = 0; i < n; i ++ )
				b[i] = a[i][0];
			sort(b, b + n, cmp);
			for (int i = 0; i < n / 2; i ++ )
				cnt += b[i];
			cout << cnt;
		}
		puts("");
	}
	return 0;
}
/*
麻雀
李荣浩
山隔壁还是山
都有一个伴
相信海枯石烂
也许我笨蛋
飞太慢会落单
太快会受伤
日子不就都这样
天会晴就会暗
我早就习惯
一日为了三餐
不至于寒酸
为给你取暖我
把翅膀折断
我遭遇那些磨难
你却不管
我飞翔在乌云之中
你看这我无动于衷
有多少次波涛汹涌
在我 心中
你飞向了雪山之巅
我留在你回忆里面
你成仙我替你
留守 人间
麻雀 也有 明天

天会晴就会暗
我早就习惯
一日为了三餐
不至于寒酸
为给你取暖我
把翅膀折断
我遭遇那些磨难
你却不管
我飞翔在乌云之中
你看着我无动于衷
有多少次波涛汹涌
在我 心中
你飞向了雪山之巅
我留在你回忆里面
你成仙我替你
留守 人间
麻雀 也有 人间

我飞翔在乌云之中
你看着我无动于衷
有多少次波涛汹涌
在我 心中
你飞向了雪山之巅
我留在你回忆里面
你成仙我替你
留守 人间
麻雀 也有 明天
*/
