#include<bits/stdc++.h>
using namespace std;
int main()
{
    freopen("employ.in","r",stdin);
    freopen("employ.out","w",stdout);
    ios::sync_with_stdio(false);
    cin.tie(0);
	cout<<0<<endl;
	return 0;
}
//这是我初中生涯最后一场比赛，从2018年第一次接触“四个柔爱吃”到两年前接触c++到现在已经6年了，如果可以再来了一次，我仍会选择编程，时间只剩下20分钟了，我太废物了，已经没的可写了，所以打算在
//最后一道题写下这个小作文，不论如何，哪怕是这一次爆0了（最好不要），我也不后悔，从两年前刚接触c++开始我经历了太多太多，在此我要向我的父母，老师，同学，战友，以及一切向我提出帮助的人说一声
//谢谢，再向我的一些年轻的战友们说一声抱歉，没能陪你们走到最后，csp我参加了3次 GESP我参加了7次无论是哪场比赛，对我的帮助都不小，在此再向无论怎样都支持我的父母说一声谢谢。我总共参加了两次集
//训，在此向和我接触不到两个星期的同学，老师，以及助教们说一声谢谢，同时向王老师说一声抱歉，您给我定的目标大概是完成不了了，白费了您的关心，，这两年来，我所增强的不只是编程，我相信在以后，
//这段经历都会成为我成功路上的阶梯，所以我不后悔。我简单回忆了一下我的OI历程，我只能说，泰裤拉，我经历了和普通人完全不一样的青春，有着和普通人不一样的特殊朋友...这一切都是“我不是普通人”的
//证明，也是我从人群中脱颖而出的资本，所以我建议每一位OIer，不要放弃你的编程梦，如果你认为这条路人才太多了根本比不过，那就对了，错误的路往往不会拥挤。话说回来了，想要实现编程梦就来********
//（展示广告位）时间只剩下五分钟了，我有太多的话想要说，时间不够了，现在祝愿所有csp-s的考生都能达到自己的目标，向着更高的目标出发，下次见面应该就是四年后了。see you,my OI life

