#include <bits/stdc++.h>

using namespace std;

int yi(int a, int b) {
	int a, b;
	int a1[101] = {0};//cunchu 2jinzhi
	int b1[101] = {0};//
	int cnt = 0;
	int ac = 0, bc = 0;
	while(a != 0){
		++cnt;
		a1[cnt] = a % 2;
		if(a % 2 == 1) a--;
		a = a / 2;
		ac++;
	}
	cnt = 0;
	while(b != 0) {
		++cnt;
		b1[cnt] = b % 2;
		if(b % 2 == 1) b--;
		b = b / 2;
		bc++;
	}
	//
	int big;
	if(ac > bc || ac == bc) big = ac;
	else big = bc;
	//
	int s[1001];
	for(int i = 1; i <= big; i++) {
		if(a1[i] == b1[i]) s[i] = 0;
		else s[i] = 1;
	}
	//
	int sum = 0;
	int lin = 1;
	sum += s[1];
	for(int i = 2; i <= big; i++) {
		lin = lin*2;
		sum += s[i] * lin;
	}
	cout << sum;
	return 0; 
}

int main() {
	freopen("xor.in","r",stdin);
	freopen("xor.out", "w", stdout);
	return 0;
}/*
?? 
���������£��ҡӡءޡޡġšơǡȡɡʡߡ�͡ΡϡСѡաססѡաסѡաסѡաסѡաסѡաסѡաסѡաסѡաסѡա� 
 �ߡߡߡߡߡߡߡߡߡߡߡߡߡߡߡߡߡߡߡߡߡߡߡߡߡߡߡߡߡߡߡ�
s'd 
 ���������£��ҡӡءޡޡġšơǡȡɡʡߡ�͡ΡϡСѡաססѡաסѡաסѡաסѡաסѡաסѡաסѡաסѡաסѡա� 
���������£��ҡӡءޡޡġšơǡȡɡʡߡ�͡ΡϡСѡաססѡաסѡաסѡաסѡաסѡաסѡաסѡաסѡաסѡա� 
���������£��ҡӡءޡޡġšơǡȡɡʡߡ�͡ΡϡСѡաססѡաסѡաסѡաסѡաס�
*/
