#include<bits/stdc++.h>
using namespace std;
typedef long long ll;
typedef double db;

int main(){
	freopen("replace.in","r",stdin);
	freopen("replace.out","w",stdout);
	cout<<0;
	return 0;
}/*
蜀道难，难于蜀道难。
大佬，恭喜您，您被我恭喜到了。
其实这道题很难，比比它简单的题目要难，比比它难的题目简单， 说白了，我白说了。
这道题还是很难想的，对于不会的人，这道题他就做不出来，如果我没猜错的话，那我就猜对了。
据我所知，我一无所知。
其实我并非一无所知，我只是什么都不知道。
接下来讲正解。正解是什么？是正确的解法，它比错解、偏解正确 ，比复杂的解法简单。
所以有句话说的好，输在起跑线上比输在终点好，因为还省得你乱跑。 
说到这我想起几个故事，是那几个呢？不是那几个，是这几个。
一次我去饭馆吃面，我大吃一斤。为什么？因为吃了一斤面。好吧，其实是我发现了一件很神奇的事 。
我发现面是用面条构成的！神奇吧？还有呢，这碗面是厨师做的！Last but not least，这碗面居然可以吃！
还有一个故事。那是一个故事。
我遇到了一个算命的，他是干啥的呢？他是算命的。
他说，“我是算命的，可你算是什么东西 ？”
我感同身受。这是个大尸啊！
他还说，我爸爸是男的，我妈妈是女的，我爸妈出生、结婚时我不在场；
我出生那天太阳从东边升起 ，那时我还没去世，所以我还活着 ；
我虽然有迪奥但是我是个男的，我虽然有高玩但我不是女的；
明天发生的事情，我后天就知道了。
我听完瞬间长脑子了，所以我现在有一个脑子。
我见过一个最聪明的警长。
他分析案发现场，现场没有脚印，作案人智商很高。
于是他逮捕了霍金。
另一次，他在案发现场发现了一个烟头，真是一个重要的线索。
这时助手说，这不是你刚抽的吗？
有个著名广告说得好：等我成为了超人强，爷爷奶奶奖励我炸蟑螂！
所以说，“为吃炸蟑螂而读书！”
回归正题。 这道题该怎么做呢？当然是找到答案然后CTRL C V三键合一呀！
那问题来了，既然有答案，那为什么要问我们呢？
综上所述，这道题是一道题！ 
*/
