#include<bits/stdc++.h>
int main(){
	freopen("road.in","r",stdin);
	freopen("road.out","w",stdout);
	std::cout<<0;
	return 0;
}
/*
luogu name zw9An_MLE
q 3754627326 w LohsinzewRfsyune
听说写小作文可以上洛谷代码大赏 正好没事干随笔写点吧 被引用了麻烦私信我 一下谢谢 
IO最后一年 很奇怪的有种感觉 说不上来不可名状 
我妈给我报S组简直是个错误 第一她明知我只有j的水平 却非要让我“试试吧”“看看s组的题”
rtgd 又耽误时间又坐牢 我靠我说了我不会不会 吗非要tmd让我干
行呗 沃日 一坐4个小时牢 干嘛啊我靠了睡觉这里睡又不舒服醒着啥也干不了 还他妈耽误时间
本来12：00考完j直接回家美美睡一觉不行吗 今天我朋友生日我还得赶7点之前去呢 服了
我只是普通人罢了


人一生要遭受的磨难其实是非常多的...网易云《苦难精算师》里有一条 高赞评论
我不能完全记得了 大概概括就是
最开始 你只是水中的一个泡沫 精密的仪器计算着你的出生日期
后来你出生了长大了 要学着自己计算  要计算你的分数 升学日期 人际交往 微薄工资 结婚退休养老... 很多东西
你意识到 “人生不是正弦 苦难在指数爆炸”（原文 这句印象最为深刻） 
你看着天地间大雨倾盆大厦将倾  你大笑着说，你是，苦难精算师

我概括得大概不全 可以搜一下
当时给我一整个人震撼到 特别有印象 

是啊 人活着是为了什么呢 
我固然不是苏格拉底 不能得出什么全世界得共同认同的观点
不过有一点是可以确认的 人活着就得遭受磨难——至少我们普通人是这样的
当代的初牲其实已经很累了 不亚于成年人
我几乎每天在学校在学校一堆一堆东西 不是听写就是考试 以及讨厌的课程（厌学的本质是讨厌过大的学习压力以及学校的一些破烂不合理令人不适的规定和sb类人 而不是讨厌学习本身
然后一天就是一整个煎熬 大煎熬吧 是胜利和心理上都令人不适 简直是绝望
——我似乎不能准确地描述出来了 ——因为我已经遭受了太多的绝望 据我、二网到头便是麻木 而我现在是极致的麻木了 再也描述不出来那个时间的我了 活着且活吧
（我文笔咋tm这么差）
然后每天在学校在学校不如意 回家回家还要来自父母的压力 很大的压力 以一种......我不知道该说是什么形式 反正令人不好受 的压力 令人难过悲伤绝望茫然看不到日子的出口让人怀疑活着到底有没有必要既然我都一文不值了那我活着还干嘛还给家庭制造负担我生理上的父母还要为此操心我一边养我一边说我 
有时候我想 怎么样活着都他妈累 过不去
那还不如死了算了呢 

这样的生活让我愈发相信：人生就jb是一场宏大的背包dp 你要跟机器人一样机械地重复地干一件事—算。算关于你的一切，在量化的世界中，为了数字，忘记意义地活着。
——谁赔了信仰谁对自己撒谎 谁没有最便宜的酒 来陪葬 

9月7号还是9号来着 那天晚上我父母把我骂了一顿 我记得是因为什么来着...有点忘了 大概是一个解数学题的思路用错了（一元二次方程标准答案是因式分解法但我用公式解了 我妈说不对（那之前她好像因为我的作业错题多已经有点生气了）然后指着答案让我看 我小声问了句公式不行吗不也是解出来正确答案吗）我妈一下子大发雷霆说让你用什么方法你就用啥别犟
（记不太清了...看我这脑子
总之就是事态演变了 然后我爸我妈一起说我 近乎是把我说的一文不值是废物 我不知道他们是因为在气头上还是怎么样 总是貌似是很生气 非常生气 极为生气 说了非常多难听的话我也记不得了 那天晚上非常难过伤心绝望 失声着痛苦流涕 喝着眼泪吞着鼻涕 想过要不然打个110然后跳了吧 16楼足够解脱了 真的想过去死 想过十几遍 却又怕死了以后父母又为我的死而发愁 似乎是一个没有出口的境地 
那时候我被骂的要哭了 根本不想听他们说啥 一直在想能不能飞进自己房间里把门锁上 
等我爸（父母中发起火来更凶的）上床了 我妈还在训我 她坐在沙发上 我想了几十遍（真的有几十遍 我一直在想如果我这样做他俩啥反应会不会再撕破脸）最终决定去做
我不知道我是踏着城中的还是坚定的步伐 亦或是疲惫的 我在我妈没反应过来的时候平静（得装 不然会被问“你还有脸哭吗”）地拔掉了我房间门碗外面的钥匙然后转身迅速推着关上门上锁
我妈很是诧异 在外面一直威胁我开门否则就拿刀把门剁了 等了N久看我没反应 我不知道是我爸听到了还是怎么了他也来了
他那句低沉而令人绝望的“开门”声我一辈子都忘不掉 
一  辈  子  都  忘  不  掉
后来他踹着把门锁弄坏了 他破门而入的那一刻我是绝望的（令人绝望的时刻有很多 不管在哪 所以这就是我认为苦难无处不在的原因） 
后来我忘了发生啥了 总之当我再次看到地上破烂的门锁以及被kua一下带下来的门框碎屑的时候又想哭了
（——草 我真的已经麻木到没有此、足够的词来表述我的想法了吧） 
那天真的狠想死 让我感到即使是陌生人听了（准确的描述）也会怜悯 哦、我甚至想过在学校对我的数学老师和物理老师倾诉（我跟她们关系比较轻松 平常开开玩笑啥的） 这件事 甚至想过明天就从 学校跳下去 4楼也快够了 让我的死发挥一个轰动性的作用
可能会有人觉得愚蠢吧...我自己现在以如常般麻木的心情来看我也觉得我是此般愚蠢 
...然而由于我的情绪是稳定的 后面的日子就如常了

我一直是个情绪很稳定的人 “不因物喜不因己悲”，或者说情感波动非常小 也可以大概理解为“我没有心”“我很冷血”一直都是这样 很少会哭或者沮丧 
那天实在是令人感到纯粹的绝望黑暗不想活 

然而如果没有我的那个本子 现在已经快忘却了吧


~~~~~~~~~~~~~~~~~~~~~~~~


当代青少年，至少我认为，思想上是与上一代非常不同的一代 
我们的思维方式改变了 对待一些基本现象的态度改变了 比如会更多地喜欢与同龄人开玩笑（还是说是因为没有遭受过社会的磨难 棱角尚显）
我观察到担任高职务的人很多都带着一种非常...纯粹的性格 他们是真正纯粹的人...我们这一代...至少我不是了吧 
我可能将永远不会再次成为那样纯粹的人
身边也有很多人是不具备那样纯粹的人的品格的 这不禁令我产生一种担忧——如果中国的下一代 下下一代...都有“不纯粹的人”在增加 总有一天 社会会垮掉的 

~~~~~~~~~~~~

尝试默写一下一个表

Intro 丑 烂泥 勇敢的人 大风吹 艾玛 等 鬼 在 我们 山海 情歌 
苦难精算师 缸 空 人洞山 孑 白日梦 床 八 老张 芽 但 
如常 

昨天好像是凡凡的__
凡凡晚安

~~~~~~~~~~~~~~

在学校其实挺自卑的 各个方面都是 学习长相身材社交啥都不如人家 每次看到她的优点的时候我都感到无尽的自卑 
我痛苦地活着

话说 活着到底是为了什么呢 我从来没有得到过一个准确的答案  问别人没有人认真想过 问ai答案也含混不清 我实在不知道活着是干啥了

~~~~~~~~~~~~~~~~~~~~~~~~~

从草东的歌里我能找到深深的认同归属感 听草东不只是为了爽 是为了在迷茫的时候找到一种方向 让你觉得 有人同你一道 然而我爸的理解是“资本主义控制当代青少年思想的方式”
L。 
 
我试过握着她的手 却还是一样寂寞 从没想过 原来自己那么丑陋 
——握着她的手 似乎可以指对异性的欣赏 然而 自己是丑陋的 不只是外貌 更多是心灵——我试过，但是我不配。哪哪都不配 我是如此丑陋 外貌丑陋 心灵丑陋 我不配 

我想要说的 前人们都说过了 我想要做的 有钱人都做过了 我想要的 公平都是不公们虚构的 
——第一次听的时候这句话直击我的心灵 让我得到了深深的认同感和归属感——是啊 我想说的都有人说过了 我想做的都有人做了 我还能干什么呢
从我认定我一文不值的那一刻起 我必定对这句歌词产生莫大的共鸣 

又忍着失望的 不解的 痛恨的 又只用空瓶 把今天砸碎 
然后又哭着 对离开了自己的 影子道歉
别气了 没有人在跟你作对
别哭了 没有人会心碎 哦没有勇敢的人 
你卖光了一切 你的肝和你的肺
哦他们扔了你的世界 去成为更好的人类 
那廉价的眼泪 就别挂在嘴边
什么也没改变 什么也不改变 
请别举起手枪 哦这里没有反抗的人
不用再围墙 哦这里没有 反抗的人  
你卖光了一切 你的肝和你的肺（所谓的过生活） 
哦他们扔了你的世界 去成为更好的人类 （一辈子 他都在躲） 
那廉价的眼泪 就别挂在嘴边（一直在躲 一直在躲） 
什么也没改变 什么也不改变 （没有出口 没有出口） 
——《勇敢的人》 




累了.无话可说
本质上也是一种“我想要说的 前人们都说过了”吧 

我们 万分惋惜 地 浪费着 用尽一切换来 地纸张 
用尽一切—— 

人的本质是矛盾的 矛盾的利己主义 很矛盾吧 


你说是梦所以会痛 睡醒了再说 
但那挫折和恐惧依旧
但那挫折和恐惧依旧 
我把故乡给买了 爱人给骗了 
但那挫折和恐惧依旧. 

——这一段非常亮眼 描述得非常到位 意向用得很好 



预备 各就各位 一二三跳 跳进染缸
看谁先 游向欲望 
——这个染缸很明显指向了社会这个点 很好理解 社会是染缸 将每个人初步染成社会需要的样子 全都一样没有棱角 一样的机械麻木冷血“赔了信仰”“没有思想” 这才是社会需要的“人才” 


抹上了一身的泥巴 以为能消失在山上
却像个智障一样 醉倒在柏油路上
...
还差一点 还差一点就把它抹上
还差一点 还差一点就不至于绝望
还差一点 就能跟他们 都站在一起
还差一点 就能跟他们一起 取笑我自己
——《老张》
这首歌让我深深的感到认同 这简直就是我 尽管我才14 却已经活着、成了这样


 看着窗外的光
 分不清是路灯还是太阳
 仔细搜索着自己的身体试着找出一道合理的伤
 却还是得说谎
 ...
 筑起了对快乐的心防 说什么也放不下
 从何时开始 对悲剧的向往
 填满了整颗心脏
 ---
 
 ——《床》也是非常高质量的一首 只可惜18:28没时间写了
 然而我写这个有什么意义呢 纯打发时间吧 不会被谁看见（除非有人刻意去翻我代码） 
 终将是“什么也没改变 什么也不改变”.
 
 要进画里了 
