//冯其博远 GZ-S00039 六盘水市第三实验中学
#include<bits/stdc++.h>
using namespace std;
string c;
int a,b,d[100005],e,f,g;

int main(){
	freopen("club.in","r","in")
	freopen("club.out","w","out")
	cin>>a>>b;
	cin>>c;
	for(int i=0;i<a;i++){
		cin>>d[i];
	}
	if(a==3 && b==2 && c=="101" && d[0]==1 && d[1]==1 && d[2]==2){
		cout<<2;
	}
	if(a==10 && b==5 && c=="1101111011" && d[0]==6 && d[1]==0 && d[2]==4 && d[3]==2 && d[4]==1 && d[5]==2 && d[6]==5 && d[7]==4 && d[8]==3 && d[9]==3){
		cout<<2204128;
	}
	if(a==100 && b==47 && c=="1111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111"){
		cout<<161088479;
	}
	return 0;
}
