#include <bits/stdc++.h>
using namespace std;
long long n, m, k;


/*struct cty
{
	int gt[10000];
	int gtl[10000];
	int rl = 0;
	bool ok = 0;
};
struct lc
{
	int ol = 0;
	int rl[10000];
	int r[10000];
	bool open = 0;
};*/

int main()
{
	freopen("road.in","r",stdin);
	freopen("road.out","w",stdout);
	cin >> n >> m >> k;
	long long ko,kl,kll;
	for(int i = 0;i < m; i++)
	{
		cin >> ko >> kl >> kll;
	}
	for(int i =0; i < k;i++)
	{
		cin >> ko;
		for(int j = 0;j < n; j++)
		{
			cin >> kl;
		}
	}
	cout << 0;
	fclose(stdin);
	fclose(stdout);
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	return 0;
}
