
#include<bits/stdc++.h>
using namespace std;
int m,n,c[10000];
char a[10000];
int main()
{
	freopen("employ.in","r",stdin);
    freopen("employ.out","w",stdout);
    cin>>m>>n;
    for(int i=1;i<=m;i++)
    {
    	cin>>a[i];
	}
	for(int i=1;i<=n;i++)
	{
		cin>>c[i];
	}
	cout<<"?反b庩}(#亏瀲??Lu@j6砄?萷惕╚?XQg?T畜蠣F煑晭=愮*髷?諜@?xWVV箽QW?苐酖?Z?忙歌鏤惏nJb??QQ]Ew?鬥s數虽?鞎誩E琙ǒ?z€篎鮃T?!?{C舊fw橙f晹J诮蚴,諢*?t洮$m婃謾艢a$貯餀苾爄?鑧翌嘫~墔惖鹧_&v憡?5JE抋\N髵:==?+篜???砧?騐h弼鍡'4謦鑁LM櫕窞Z鷠抌m[>/Х殚O濢<窠?z騟绥看?)??TC尣?,樣&胱AY赊+賩@蔟謜柍甈!k典4UI??跌x,?z?Z,?朇”栨楤:??m我gh{?夢s蔋'巖&腩}/a?彘劀葜V鞱Rl
?绱[?陒唼?澬p蘕C右讌A";
	return 0;	
} 