#include<cstdio>
using namespace std;
int main()
{
	freopen("replace.in","r",stdin);
	freopen("replace.out","w",stdout);
	fclose(stdin);
	fclose(stdout);
	return 0;
}
//freopen
//T3 replace
//Luogu: WOLFSTAR(1044658)
//CSP-S2025 rp++
//NOIP2025 rp++
//来てくれてありがとう！

//坏了字符串我是真不会，象征性地交一下得了

//现在还有15min结束，剩下的完全没思路，T1 A了已经可以了，事已至此打会歌词玩吧
//（但是我并没有办法打出日文字体的汉字，只能用搜狗的符号功能打打假名）
//アイスドロップ - Aqu3ra
//いつから满たされない  こんな日々だから伤ついて
//すぐに踏み出せない  正体が见えないまま
//いつかの思い出も  たかが1000年の物语
//深く呼吸して  深海に落ちていくの
//暧昧だったシーズンが  去って仆のとなり
//望远镜で见せた  景色见に行かなくちゃ
//uh~  その声が心ごと润して
//络まりあって  惹れ合って  また变わらず爱を呗う
//you  きみの手を  离さないルールとして
//サビついた最后のページを  溶かすためのハート
//このセカイを回す  唯一の魔法