#include<bits/stdc++.h>
using namespace std;
#define int long long
const int N=2e5+5;

signed main()
{
	freopen("employ.in","r",stdin);
	freopen("employ.out","w",stdout);
	
	int n,m;
	cout<<n*m;
}
/*
离考试结束还有半小时。。能做的都做了。。该乱写的也乱写了。。
总是有一种浪费了560报名费的感觉。。
在昨天，我还和妈妈扯皮，说S组就是给我睡觉用的
但今天，在S考场的我，却一直萦绕着浅青色的忧伤

上午J组的时候，本来就因为T3是n方的复杂度得不了全分而忧心的时候
一边不认识的同学对着他的校友说：“你这回能AK吗”
早上我进校时有给一个小学生带路，她对我说：“姐姐，T3是不是...那样做就行了”
于是心境越发低落，像是沉到了水草的深处，却还是坚持着吐水要呼吸

昨天晚上，教练讲着考前事项，安慰我们
说：“题做不出来，上个厕所洗洗手就‘茅塞顿开’了” 
可我去了，甚至洗了脸，依旧是做不出题来
愁思着，苦想着，思路却悄悄的溜去了

只能苦笑着，装作不在意的样子面对别人，哄骗着自己
“哎呀，没事的啦。一次比赛而已，我的路还很长呢”
却还是在将那些忧愁堵在心口，瞒着所有人
只是在夜深人静的时候，抱着玩偶掉眼泪：“我怎么这么没用？”

语文老师青见这周布置了写景作文，半命题“窗外...”
我挠着头发，实在想不出怎么按照她当时上与朱元思书所讲：
“看山是山，看山不是山，看山还是山”
“看水是水，看水不是水，看水还是水”

现在却看着自己胡乱写出的代码，心里难受着
天色越发的黑了，灰蒙蒙的一片 ，没有月亮，树影迷离 
就好像“看天是夜色灰暗，看云是流光隐匿，看树是婆娑黑影“
最后“看自己是自己，看自己不是自己，看自己还是自己” 

*/ 
