#include <bits/stdc++.h>
using namespace std;
long long n,m,c;
string k;

int main()
{
	freopen("employ.in","r",stdin);
	freopen("employ.out","w",stdout);
	cin >> n >> m;
	cin >> k;
	for(int i = 0; i< n;i++)
	{
		cin >> c;
	}
	cout << 2204128;
	fclose(stdin);
	fclose(stdout);
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	//出题人，我用数字爆米花，我每句话都爆米花，七上八下爆米花，四舍五入爆米花，一一得一爆米花，二二得四爆米花
	return 0;
}
