/*
这里是游记部分
考场实录哦

先来点引索

froepen
replace1.in
replace.ans
114514
love

是这样的，现在在这里的是一位已退役高龄OI选手（高三牲口），出现在这里呢，无非是为了自己的学校/省份争取一点人头数
所以分数是不必在意的，只要不改规定。
（改规定那是真要命了，因为我是真的做不出，估计实力倒退 3 年吧）

不过还是认真读了题
T1 一如既往很简单啊，秒了
但太久脱离OI，选择的是比较史的实现方式。
为什么我知道这比较史呢，因为码的时候意识到了有更简洁的方法，不过还是头铁地一史到底了
（话说我左边这哥们好像卡 T1 了，看到他在对着 club 狂躁，这都快开场 2h 了，有点替他担心）

T2 想到了个做法，最小生成树，但遗憾的是计算出的时间复杂度有点爆，所以就还没有码，可能晚点会去打吧
T3，字符串弱势，不会
T4，以为想出了个不错的做法，推到一半已经假了
唔，等会补个暴力吧
OI 时间暂时结束，再开把俄罗斯方块吧

结束了，2175
不知道算不算高分，总之我是玩不动了
挺好奇 Linux 里的俄罗斯方块是随意给块吗，中间连出近 10 个长条吓傻我了

出去溜达一下

c，不会建图了
反正是菜比身份，乱抡暴力了

唉，废物老登骗分来的
蒜鸟蒜鸟

写点什么好呢，写些在役时没能留意到却挺重要的东西吧
一，珍惜时间
这不是在劝你们快给我去学习！快点去写代码！快点去学算法！
不是的，人不搞颓怎么能活得下去呢。我只是想说，时间这东西真的挺有意思的，过了就没了。
所以说时间要过出价值啊，自然不只有学习会产生价值，娱乐，运动，游戏自然都有价值的。
怎么是个有价值呢，以我的判断方法：如果日后某时回想起这一刻，你觉得是不错的，你觉得是开心的，就是有价值的。
就像我在这写这乱七八糟的玩意而不是去想题，我会觉得这会很好玩，所以它有价值。
不过多说一点，失败总是贯穿人生的始终，回想过去，大抵总会有让人伤心的事，总会有没价值的事发生。
不要在意，总会有的，但过去就让它过去，已然发生，无所大谓，还是要当下
还是要在现在做觉得有意义的事
换种说法，做你想做的事情
虽然这很需要行动力，但我相信大家会有的
还想写点东西，但想得不明不白，写得也不明不白
文笔太差劲罢
说到这个，我很推荐大家去写写日记之类的东西
也不一定是日记吧，有个小本子能写写想写的东西就好
写东西的过程很舒心的，尽管可能会有点慢
写些什么留下来，也许是给后人看，也许是给以后的自己看
有时我看看曾经的字，才发觉自己已经变化了很多
身边的事，身边的人也都变了很多
回头看过去总是很好玩的，只是怕想不起很多，所以写下点什么，会更好玩
把历史刻在石头上，把时光留在字句中
欸，回头看来，我不只文章写得乱，生活过得也挺乱的
想一出是一出做一出，不过也还挺有意思，做别人没做过的事也是很好玩的
比如说最近的一个想法：给在外校的朋友寄信，但不知道他在哪个班，所以决定每个班都寄一封
怎么想怎么好玩啊

还有5分钟下考了
留一句最近很喜欢的话：
我必须考虑这会不会是我此生仅有的机会
唔，祝各位好运，人生顺利
爱你们
*/