#include<bits/stdc++.h>
using namespace std;

int main(){
	//freopen(".in","r",stdin);
	//freopen(".out","w",stdout);
	ios::sync_with_stdio(0);
	cin.tie(0);
	cout.tie(0);
	
	return 0;
}
/*
滚滚长江东逝水
现在是2025.11.1 17：39
七年的OI生涯就到此为止了吧
初三不会把精力放在OI上
高中应该也不会走信竞的
2019～2021 摆烂
2022～2023 认真OI
2024～2025还是摆烂
或许，OI生涯的终止和我其实并不怎么努力有很大的关系罢

是非成败转头空
曾经取得的成绩已经没有任何意义
侥幸心理，模板不背送走了我的最后一场CSP
或许这16分甚至更多分能够决定一切
[0,100+0+50+8]一等是不可能了，二等都有概率挂掉，我只能接受我的退步

都付笑谈中
这些都不重要了
即使心中有再多的悔恨，时光也不会回头
虽然whk也不算好，还是祝愿未来在whk的道路上，能够乘风破浪，取得自己满意的结果吧
 
~~请不要开盒我，谢谢~~
*/
