#include<bits/stdc++.h>
using namespace std;
#define int long long
string s[200010][3];
int c[200010][3];
int cnt[10000010];
const int mod=1000002089;//ΔγÒͺΚΗΥζΏ¨ΥβΝζÒβΞÒÒ²ΘΟΑΛ
int gethash(string x){
	int num=0;
	int len=x.size()-1;
	for(int i=0;i<=len;i++){
		num*=55;
		num+=x[i]-'a'+1;
		num%=mod;
	}
	return num;
}
signed main(){
	freopen("replace.in","r",stdin);
	freopen("replace.out","w",stdout);
	int n,q;
	cin>>n>>q;
	int all_cnt=0;
	for(int i=1;i<=n;i++)
	cin>>s[i][1]>>s[i][2],all_cnt+=s[i][1].size(),all_cnt+=s[i][2].size();
	for(int i=1;i<=n;i++)
	c[i][1]=gethash(s[i][1]),c[i][2]=gethash(s[i][2]);
	if(n<=1000 && q<=1000 && all_cnt<=2000){
		for(int i=1;i<=q;i++){
			string x,y;
			cin>>x>>y;
			int ans=0;
			if(x.size()!=y.size()){
				cout<<'0'<<"\n";
				continue;
			}
			int fi=0,en=x.size()-1;
			for(int j=0;j<=x.size()-1;j++){
				if(x[j]!=y[j]){
					fi=j;
					break;
				}
			}
			for(int j=x.size()-1;j>=0;j--){
				if(x[j]!=y[j]){
					en=j;
					break;
				}
			}
			for(int j=1;j<=n;j++){
				if(x.size()>=s[j][1].size()){
					for(int k=0;k<=x.size()-s[j][1].size();k++){
						string now_x="",now_y="";
						for(int l=k;l<=k+s[j][1].size()-1;l++){
							now_x+=x[l];
							now_y+=y[l];
						}
						if(gethash(now_x)==c[j][1] && gethash(now_y)==c[j][2] && k<=fi && k+s[j][1].size()-1>=en)
						ans++;
					}
				}
			}
			cout<<ans<<"\n";
		}
		return 0;
	}
	for(int i=1;i<=n;i++){
		int num1=-1,num2=-1;
		for(int j=1;j<=s[i][1].size();j++){
			if(s[i][1][j]=='b'){
				num1=j;
			}
			if(s[i][2][j]=='b'){
				num2=j;
			}
		}
		cnt[num1-num2+1000000]++;
	}
	for(int i=1;i<=q;i++){
		string x,y;
		cin>>x>>y;
		if(x.size()!=y.size()){
			printf("0");
			continue;
		}
		int numx=-1,numy=-1;
		for(int j=0;j<=x.size()-1;j++){
			if(x[j]=='b'){
				numx=j;
			}
			if(y[j]=='b'){
				numy=j;
			}
		}
		cout<<cnt[numx-numy+1000000]<<"\n";
	}
	return 0;
}
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ 
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχίχ
//ΝΛÒΫΗ°£¬³’ΚΤΙΟÒ»΄ΞΘΛΐΰΓΤ»σΠΠΞͺ΄σΙΝ
//luogu wolfiez 
