#include<bits/stdc++.h>
using namespace std;
int main(){
    ios::sync_with_stdio(0),cin.tie(0),cout.tie(0);
    freopen("employ.in","r",stdin);
    freopen("employ.out","w",stdout);
    cout<<496109852;//CCF,抱歉让您失望了，T4又是一点不会，或许我应该再学一年，多刷题，才能拿到S1=吧
    return 0;//另外，若上面的答案蒙对了，还另请施舍4分，某人在此感激不尽
}
//以下为无聊时抒发的胡思乱想（我在写什么）
//滚滚长江东逝水，浪花淘尽英雄，是非成败转头空，青山依旧在，几度夕阳红。
//（后面忘了）


//当秋天撒下最后一把枫叶时，正是我离开的时候
//看着收拾好的行李，想起远方的你，心里竟然有一股幸福的感觉
//就在这个时候，地上的枫叶，刹那间……

//飞起来，飞过来，飞进我，深深情怀。
//越过那，宁静海，充满着，回忆的海。
//那阳光，撒下了爱，催促着，万物张开。
//那彩虹，像个小孩，勇敢地，坚定地，站起来。

//飞过那，矮竹篱，擦过那，斑驳墙壁。
//发黄的，照片里，痛快着，那么熟悉。
//不经意，和你相遇，在天空，飘着小雨。
//落下来，清澈的溪，甜美的，每一点，每一滴。

//枫叶啊，载满着我的感动。
//枫叶啊，倾听着我性情忠。
//深秋里，伴随着亮丽的梦。
//冲向我………

//化成了满山和满谷的对你思念。
//写满了满天和满地的爱的诗篇。
//咏叹着生命的美丽和世界的无限。
//飞舞在以后和从前，它连成一片。

//随着溪，流了去，随着河，又流了来。
//离去时，心感激，归来时，满心期待。
//因为爱，所以存在，露湿的，绿色青苔。
//晨曦中，迎风而来，飞进了，我心中的大海。

//枫叶啊，载满着我的感动。
//枫叶啊，倾听着我性情忠。
//深秋里，伴随着亮丽的梦。
//冲向我……

//化成了满山和满谷的对你思念。
//写满了满地和满天的爱的诗篇。
//咏叹着生命的美丽和世界的无限。
//飞舞在以后和从前，它连成一片。

//化成了满山和满谷的对你思念。
//写满了满地和满天的爱的诗篇。
//咏叹着生命的美丽和世界的无限。
//飞舞在以后和从前，它连成一片。

//化成了满山和满谷的对你思念。
//写满了满地和满天的爱的诗篇。
//咏叹着生命的美丽和世界的无限。
//飞舞在以后和从前，它连成一片。
