#include<bits/stdc++.h>
using namespace std;
int q;
int main(){
	freopen("replace.in","r",stdin);
	freopen("replace.out","w",stdout);
	cin>>q;
	for(int i=1;i<=q;i++){
		cout<<0<<endl;
	}
	return 0;
	//不行了我真的不会了,等高中的时候再来考提高组吧;
	//不是我第一题都不会是废物吗?
	//不是入门组别搞我呀,那个文件是什么东西,不会系统识别不了吧.
	/*谢谢老师家长和同学们对我的支持，但我可能真的会辜负你们了,我还是
	希望中考的时候好好考(我脑子没那么灵光，还是好好学习基础吧)，
	考一个好一点的高中，好好接触一下其他竞赛和
	社团。可惜吧今年不能好好地画一个句号了，接下来不到2/3年的时间好好
	学习文化课，有时间发展发展艺术，做一些我喜欢的事，就算是好好爱自己了
	加油吧！！！*/ 
}
/*AFO*/
/* 
笔名:唐a可可 洛谷:Practice_drawing 

笔名来源:"唐"选自于鲁迅之前用过的笔名姓,"a"是英文中的第一个字母, 代表着中英双语
		  相通,"可可"是作者之前的英文名"Coco"音译而来. 

丑奴儿·诀别竞赛迎凉有感  Cocoduke 
三年不识离别味,时又逢秋,时又逢秋,鹅黄已而染青柳.
而今深陷悲情中,风拂过愁,风拂过愁,青黛徐徐浸黄楼 

翻译:这三年以来不知道(与信息竞赛)离别的滋味,又到了秋季,原本青绿的杨柳早已
染上了鹅黄色.如今我深陷在(比赛失利)的悲伤情绪中,秋风拂过我的愁绪,(原本黄昏下)
金黄的楼宇也渐渐地被黑夜的青黛色浸没 

水调歌头·赛后赋          Cocoduke 
算路几时有,草草过三年,不知尽其之日,何住泪涟涟.
我欲隐而归去,又恐遭人叽语.月嵌天黛蓝,水中莹月影,绕月于船前.
大弦起,小弦落,漪涟涟.不应有悲,秋风何必伤画扇.时有春夏秋冬,物有风花雪月.
心意本难全,但愿吾心静,心远地自偏. 

翻译:我是什么时候踏上信息的道路的,就这么草草地过了三年,可惜不知道走完的时候
泪水涟涟不止.我想悄悄地回去(再学学),又害怕遭到别人的闲言碎语.月亮现在镶嵌在
深蓝色的天空上,水中的亮光是月亮的影子,我乘船在船头围绕着月影航行.船儿荡起的水波
像旋律高起的大弦,落下时又如切切的小弦微微散开.我没有什么悲伤的,秋风哪有必要
为画扇感伤呢?四季有春夏秋冬,美好的事物有风花雪月.其实人的心意很难被成全,
但愿我的心是静的,心离世俗喧嚣远了也就感觉到地理位置远离市井杂俗了.
 */
