#include<bits/stdc++.h>
using namespace std;
#define N 555
#define int long long
int n,m,u[N];
string s;
signed main(){
	freopen("employ.in","r",stdin);
	freopen("employ.out","w",stdout);
	int i,ans;
	cin>>n>>m;
	cin>>s;
	//老师不要查我代码^_^ 
	//老师不要查我代码^_^ 
	//老师不要查我代码^_^ 
	//老师不要查我代码^_^ 
	//老师不要查我代码^_^ 
	for(i=1;i<=n;i++)cin>>u[i];
	
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<"到底是谁忽悠我报的S组!!!!!!!!!!!!!!!!\n";
	cout<<ans;
	return 0;
}
